#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-staging/runs/run-DuDFKJQFGKRhRAa5

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
aws_iam_user.imagebuilder_worker: Refreshing state... [id=imagebuilder_worker_staging]
aws_s3_bucket.imagebuilder_s3: Refreshing state... [id=imagebuilder.service.staging]
aws_sqs_queue.image_builder_pozorbot: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/933752197999/image-builder-pozorbot-staging]
aws_cloudwatch_log_group.internal_composer: Refreshing state... [id=staging_internal]
aws_iam_user.packer: Refreshing state... [id=packer_staging]
aws_cloudwatch_log_group.external_composer: Refreshing state... [id=staging_external]
aws_cloudwatch_log_group.pozorbot_cloudwatch_logs: Refreshing state... [id=/aws/lambda/pozorbot_staging]
aws_iam_policy.spotfleet_iam_spot_policy: Refreshing state... [id=arn:aws:iam::933752197999:policy/spotfleet_iam_spot_policy_staging]
aws_cloudwatch_log_stream.internal_composer_syslog: Refreshing state... [id=composer_syslog]
aws_iam_role.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_role.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_cloudwatch_log_stream.internal_worker_syslog: Refreshing state... [id=worker_syslog]
aws_cloudwatch_log_stream.external_worker_syslog: Refreshing state... [id=worker_syslog]
aws_iam_policy.vmimport_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_s3_staging]
aws_cloudwatch_log_stream.external_composer_syslog: Refreshing state... [id=composer_syslog]
aws_iam_role.external_worker: Refreshing state... [id=external_worker_staging]
aws_iam_role.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_policy.vmimport_ec2: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_ec2_staging]
aws_iam_policy.packer: Refreshing state... [id=arn:aws:iam::933752197999:policy/packer_staging]
aws_iam_role.spot_fleet_tagging_role: Refreshing state... [id=imagebuilder_spot_fleet_role_staging]
aws_iam_role.vmimport: Refreshing state... [id=vmimport_staging]
aws_iam_role.pozorbot_lambda_role: Refreshing state... [id=pozorbot_lambda_role_staging]
aws_iam_policy.pozorbot_read_secrets: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_read_secrets_staging]
aws_iam_instance_profile.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_instance_profile.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_policy.internal_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_composer_read_keys_staging]
aws_iam_policy.pozorbot_client_sqs: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_client_sqs_staging]
aws_iam_policy.pozorbot_lambda_sqs: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_lambda_sqs_staging]
aws_iam_policy.pozorbot_lambda_cloudwatch: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_lambda_cloudwatch_staging]
aws_iam_instance_profile.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_instance_profile.external_worker: Refreshing state... [id=external_worker_staging]
aws_iam_policy.external_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_composer_read_keys_staging]
aws_iam_role_policy_attachment.spotfleet_iam_role_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656385800000003]
aws_iam_user_policy_attachment.imagebuilder_vmimport: Refreshing state... [id=imagebuilder_worker_staging-20210121192045197600000002]
aws_iam_role_policy_attachment.spotfleet_iam_spot_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656553800000004]
aws_iam_policy.internal_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_worker_read_keys_staging]
aws_iam_policy.external_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_worker_read_keys_staging]
aws_iam_user_policy_attachment.packer: Refreshing state... [id=packer_staging-20201204204656365500000001]
aws_iam_role_policy_attachment.vmimport_s3: Refreshing state... [id=vmimport_staging-20210121192044923500000001]
aws_iam_role_policy_attachment.vmimport_ec2: Refreshing state... [id=vmimport_staging-20210121192045244900000003]
aws_iam_policy.internal_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_cloudwatch_logging_staging]
aws_vpc_endpoint.external_vpc_s3: Refreshing state... [id=vpce-0249da6b762fae5de]
aws_security_group.external_workers: Refreshing state... [id=sg-0f578bf2872026f5d]
aws_security_group.internal_allow_trusted: Refreshing state... [id=sg-084607083aaa39727]
aws_security_group.internal_allow_egress: Refreshing state... [id=sg-0eb65fd8f2c17dba5]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-08d5fdb7cd26e5c94]
aws_iam_policy.external_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_cloudwatch_logging_staging]
aws_lambda_function.pozorbot_lambda: Refreshing state... [id=pozorbot_staging]
aws_iam_role_policy_attachment.internal_composer_read_keys: Refreshing state... [id=internal_composer_staging-20201204204656559200000005]
aws_iam_role_policy_attachment.pozorbot_lambda_secrets: Refreshing state... [id=pozorbot_lambda_role_staging-20210127150546817300000001]
aws_iam_role_policy_attachment.pozorbot_lambda_sqs: Refreshing state... [id=pozorbot_lambda_role_staging-20210127130509124000000001]
aws_iam_role_policy_attachment.internal_pozorbot_composer: Refreshing state... [id=internal_worker_staging-20210127152215241500000004]
aws_iam_role_policy_attachment.external_pozorbot_worker: Refreshing state... [id=external_composer_staging-20210127152215237300000002]
aws_iam_role_policy_attachment.internal_pozorbot_worker: Refreshing state... [id=internal_composer_staging-20210127152215216300000001]
aws_iam_role_policy_attachment.external_pozorbot_composer: Refreshing state... [id=external_worker_staging-20210127152215239700000003]
aws_iam_role_policy_attachment.pozorbot_lambda_cloudwatch: Refreshing state... [id=pozorbot_lambda_role_staging-20210127132820714600000001]
aws_iam_role_policy_attachment.external_composer_read_keys: Refreshing state... [id=external_composer_staging-20210113202541907800000001]
aws_iam_role_policy_attachment.external_worker_read_keys: Refreshing state... [id=external_worker_staging-20210113202541913700000002]
aws_iam_role_policy_attachment.internal_worker_read_keys: Refreshing state... [id=internal_worker_staging-20201204204656366800000002]
aws_iam_role_policy_attachment.internal_cloudwatch_composer: Refreshing state... [id=internal_worker_staging-2020120420465704850000000b]
aws_iam_role_policy_attachment.internal_cloudwatch_worker: Refreshing state... [id=internal_composer_staging-2020120420465704340000000a]
aws_iam_role_policy_attachment.external_cloudwatch_worker: Refreshing state... [id=external_composer_staging-20210113203644029600000002]
aws_iam_role_policy_attachment.external_cloudwatch_composer: Refreshing state... [id=external_worker_staging-20210113203644009900000001]
aws_iam_policy.imagebuilder_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder_workers_s3_staging]
aws_vpc_endpoint.internal_vpc_cloudwatch_logs: Refreshing state... [id=vpce-01e031ba5033ab0c5]
aws_vpc_endpoint.internal_vpc_secretsmanager: Refreshing state... [id=vpce-0d13154306549b1cd]
aws_security_group.external_composer: Refreshing state... [id=sg-0be4cfbfac3cc0022]
aws_lambda_event_source_mapping.pozorbot_sqs: Refreshing state... [id=7ae0421e-5c59-4b9e-971a-aab448662f51]
aws_iam_user_policy_attachment.imagebuilder_s3: Refreshing state... [id=imagebuilder_worker_staging-2020120420465705150000000c]
aws_ebs_volume.composer_internal: Refreshing state... [id=vol-058d1cec56397f102]
aws_network_interface.composer_internal: Refreshing state... [id=eni-07088640399f60f49]
aws_ebs_volume.composer_external: Refreshing state... [id=vol-0daeecfc25da04a05]
aws_network_interface.composer_external: Refreshing state... [id=eni-02f250427cdd85dc7]
aws_instance.composer_internal: Refreshing state... [id=i-027976fb9244722ee]
aws_instance.composer_external: Refreshing state... [id=i-0418ebc127d387b16]
aws_eip.lb: Refreshing state... [id=eipalloc-0f8be222c563c4767]
aws_launch_template.worker_internal_x86: Refreshing state... [id=lt-0a23e96f3feb1649c]
aws_volume_attachment.composer_internal: Refreshing state... [id=vai-777369723]
aws_volume_attachment.composer_external: Refreshing state... [id=vai-1070839764]
aws_launch_template.worker_external_x86: Refreshing state... [id=lt-0195b4ef20679c780]
aws_spot_fleet_request.workers_internal_x86: Refreshing state... [id=sfr-42015bc6-166c-4fcf-b0e8-5f9fe66fddb5]
aws_spot_fleet_request.workers_external_x86: Refreshing state... [id=sfr-953d7aa5-e8cc-4a45-afee-cee5a9453de6]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_cloudinit_config.external_workers_cloud_init will be read during apply
  # (config refers to values not yet known)
 <= data "template_cloudinit_config" "external_workers_cloud_init"  {
      ~ id            = "2119630125" -> (known after apply)
      ~ rendered      = "H4sIAAAAAAAA/9RZ2ZLqyJm+J6LfIYeuibbjjEALUEXZ1WEEEqsEaAU8DiKVSpBQaikpxXZ8XmRu5nYebx5hQiCqqTqn227bERNdN1XK/Lf88l+zunFEcUQZ45TgZxDmhPoJTGk99I/Y/QNw4jxyYXp6qSpDRRKnptrraMtqpfhiLJxmfhw9A67Gflf5rsIw90TfVW6ye36WxJlPL7SQUoi8EEf0D2DjExzBEL9U/cinNbTZVn/iMlIYZRucMlKEYtePts/g0fHpHcHFZIqPtI5InLsMiqONv/2uovgh/sq47+9pKpU8w2n2XAGAAYUFzwAjnikWKwAAkGXeGubUi1P/jN11gE8X2uKHAdUs85g0g6DT6XREQT3DLndCvFR89jrzjtjpdLqdefe428jDIelvulHbR2RwCu1UElPD5MmkRQO9b3A4eXS7s/OB2y1bduTNyWyhJHiW+upRXZD+E7Kn7bomJ6LLntvyQT19CjZbr73JT+qy0R5+UmBrejIscdv01Fg+brRFv+kPKKrrcxI5kuyPEz1oED+JG/MVFWm47bxuA73T6p2909Zp5U2l7R+N4bFhi7tcV9j+Yn5WdwnenHw7/5QNtU8eb6bzYNwR83y4nDvpjnySPSuEk326PxlTPs+mdB8txZ3nzA6n6SNvz3YwGbv1tmfA15nEHeRTy5T5aIEas+2B3fpzp5X5jmycH1UDH22hOW8/vSbzqa0sxyjZrlKiw8FgvNIVj56nj4q7SqcT2VzEOtfBnVNj61GkplPRIE5T388ehfOZfRU1mUfdaWPKHpLm4fA68/YHPqKOkBiTGXUxHX2ymux8FiXR4qTr0Srhz/IBYZ5zFsfWY+S1SeRN0tV2hx9RPI9mHflYR0RoSfrotPXzGRIPnwLuaZmTpbIwX6FIg8NoEmi7XrIzFjxuKiOuFfces9EANep2MzhtJntXySzPfeW6i0HfsqbJOd46bLtpLX1WW8hJtNLqHLa23br2ybZOdLlZPrHpxpoitxPz/dUmGjXPS81cjEZtZRXA6HgUpEdz6gfSSG1n5o5n2XOrezqxw83w1XBGnNjcPG5cASItnTR6aGm68rDOiSfVbsnc7hGt/E5/Ohqrznkhs4ZAN09HFnPzlxcQwl2c/inFrgdpDcVh9b2/Y5dvNrn2xee7V58nq96QUw2pWawNZyK3k0kjacmG6B8HRuswDVqLp2hXXz3ieKbOpbrCHsaNp+YYxE7uQv+dssoh9SleFxmhDMsEUu8Z1GmYXMN7XeSI9R6m2cUydM0Cz+CvpaFTXTSHk966O1WUofHyJCC4eWJZ3OSbfMNpcI3N46bpbJoQs66A2hyPntpcmy+5u1NlNtUl7cb+uGlioeW67cYT12Q3EDUcVmgJLdRyhbbjPLYwj584d/NReWfdlTTjZaKzdKJzXc10R4Yv9jRrZOrmajRnZVO77LG0G3Aj3dQkS1J7c3u1WLGyoJsjccUSy+ypc4VfnlVL7JtBk3P4FYtDpWn0Al7re6bDa6LLapptJhOHS0ZwsNoZgaxp5mE8J7LosqtXzbLUeUAGc0O2NFMWXPboK2wzWcluhrikpy5WO8dWBb3v7YyAe50v3JklWS3D0lbY5CTLUBewr06NRSK6h6TYa7zbC+SFYY00l7Ui29Rs05IlTZJZN1RO+k72LMFLjT7bxFbSmrOqaLJE0GR5pQd0bwckdkN12r3YPOqapiyteFc2JVm60NrtXvE9D2R1HompbclL3VKV5dmb2HaimhaJcCRqU1MVFW40UUJ3qPXE43Ihn93ddry0RjsrUHiVKM1V4B010zxC82jZ0pOg9EYa3llnyCexIiRHY0AG5s4TTLLcT3h1pNjDI9qJFrYSY8keocIhwbKS0/wQs2pPC5dCfDYWpOHIasvirJXJidE8IBPYd8XpQKaIJLpit8OlrZ3wwNKNLj07wUrSbdpQBJQuz/J4ZVm5EqqZIrtJl1is3RsNNG7V04irGry8XwVaastWT4usiT5wx6bt9o2BdtYlFdq2GrrEtXU5gWrQaLise1CIDG1j2FyePc5ZiK+K1Rmb0iqzJaWx6svQkDjPlomvGaKqLzRbkdShHomCxpLDMiK5YxHT6dKzFlm809P2Vp874UG8xwuvhSSNtwJuhgJ55MyThsNnAiIWtQZWoPUt2eRGXYN3RcWk3NLkdGtgefpC1JzzKHCE1XF87hy1cHmem42TZaqiy1ri3JanlsT1tYU7NC0idclKV6R2d06IrAWxsDJWS0UIDqt+O0N6e7wkq2QZkMTltdzkOqkacN2p5IqKZQX6wtVsk+suTbmv71yiku0ZG2Lg8Ifxz/CKN15t4cpzvy2Y5kqdm1x3bi8b346r45uPzreJqEUJr/KE6CxqOnIyQcHwZNgchJJ81CWiYPvoGQKxkYEE7Uy6hjUytUg92JHJKoOhoHGasGS12A23nGaqe12W/W54TF1DXKpme7liNd4eqF3Ub/f1wYhXJDrT7aOhctZYWSwPaj/b64RE9gClTj8xrYGyny6Sg7PzdCs8UjQw9xrLzQzDHJv2aGB26RTuLIjOVqixqwWUGoJhDDnTpta0Nxo7A4/ogZyZC2845489s281zEBVl4bcVBcdweo3o2lPnOjEZbElzqfzhDV5V51HHUG1LH1lP7GqaTZMKTnpUecMB2SvyqPG1BppGk9P2FZ1feGG88DjoeCperjKEa8Itt7mVZtw2s6jWOJa3Z3KLoO4OWaTpmbKnD6Ij8vA5ZCpLseCPDYtzXS7bc05L09u4C6WZtA0udVkSZTG0vKU+Xk0VSN5B+3REe3MxmqnSXowH+uRmhn6k4AGahPt5L260NhlMMpVEnDzhdLu+tecrJlNaSipskm0kRaQ3tzS5GsuZ8cfK8Vgqhsv+EhxGkFSyyjc+tG2qGZJnOG0FmdO7hO3Fqfbj5ydXk+TdP2Fe+RrAldrNWocV9LYU20saWtdn6zH0lJfdzT1BabRMzxkzxlGKaZZCCO4xelznjEYZpThntuC8NjkufZju90uqZ4znO59hC+9KzPk+4Idlyp0U9S72nBmDKfqWumonX5Z9jpq75/QlzsZSv2k6PKZkoVBcRjCyGWC+ZLE7Zv+pW5IygU+taNI65kmycPFSwkgc0OUOcRpUPbjd9j1htpLHVNUL/FlboDfpEtdTTL0t4NJam82HarG2tQmLx6lSfZcr78/We3tZDUYwnMcwUNW3GP9vg/5lsqvFmo0Dsm325M/B/HO/0v5AQmJD9hdu3EI/SgDL+DPoEoxDO+9pvofoOrlTs1J8eHj+hWbr7fATQOC4AVUv201ggxKaS3BRd9VWncV+Kvt+5fZ8QHpMI58mqJvQ/k9UIptcJ3l8hQWPgc2cQqGIdxiIBZqcAr8CHRsvfbG1YtR9gxuPhBedFzu+fJX3Y1RXsylF3HXtZpHQ1J5E9D1MAoA3uP0BAQWZBjFkZsBGLmAxFtAY5CdMhJvbyozTIELcRhHQGDv1griK+VPsjsF5AAihLMM7H1YzKCA5lGEyUUwxoB6GIS3k2cxwfd6imO5IIlTCvgnji+MKneLnzzDALpuWggnMYLEizN6tw+v2t3Qj54vKn4yzMKpvzkB6kEKDviHFIMopgBD6kfbgu9qFg7j9ATi6PLlRxmFEXqzrzuQuuMy7sFDEfhvqv3NjTfPirv7ETw2//3OsOJWmwCdEMHZ3TL1cATwESNQz7O0fjlS3fGjehKf49SJ6RoSnN6dQoqyPL1CmMYxvTw9ZKeM4hD4WfQDBZuckPf2ysOJVNp8YZl1jAGo31ueJRDhN8Of2K8Np374zu6DTz0/Aty/4khXbyx9w9+AAwYIRiDFEHkAuVHtp/nqpxhQp4b0u9CDJxdHv38GNgYHnxAAyQGeMrDFFEDQYAXg4RQDByNYeE68AYj4OKIA4ZRm72EqrhOkHiZr5EbAHhoDUNa3D0bcI7eBPsH3Dpr40fYfAOMXRRax0GgI90tpTGMUk2sSuNvIKKR5kecarPDhukCWERBf6loGPoNupxjwhvKw2zGkwkXKjJV6WVhHsH49L5PjpEhs4Ms/dKi3XPg3D/91cvy3C6kDM+/t0nUcueDCkxX+chNTe59Pf8gAjvZ+GkdFFgR7mPrQITgDMMXglhyxe3GN5zfWX51Ov5dUa6hNVUVSjZszz03JlN5V6Ncc5/hDOb5vO+p+keoZ55rqmduRmLKLKOUqkq53+tJL9X//+7/+BzwoU3VorIuB27jEZ7mgS5o17EpF9ipXLj4N6e2z1zGk23uIJunmxHh5+B08ZCB7zUCGI5cJcXbJAgxzMZzJUwIe3k4FmBsB48TuCVQfSsOqvy+lYuTF4OEqu/KxGO4xonFa/vqlFiOL8xThrLaL86KDcm9FmJ4SXJTh2/rtLPiISO7idR759FLkq6WOsnms/uWtP8j8KMhqcU4/yoSHbH15nzlAirw1ibfZTbwfJTktm4c31W+dAY7cJPYjWgi53XrB/bPd2E3sNo3zZB3B8KK/vPD1rW28UWU0xTB8I7s2Kutr1X07f/myXEOxi9EFoSyOqpVKmkcodK/vUMgLYxd8Ov4dQXslZR9Z9mMXw4BrsUGUABwVYQUYJooPZT2/wv4LT+i/5jH8yGQeJuTajf/ca/hdlii6BwbnMUj8BBdZtHL1o2+/vVW+B31M35V5MOzVKkNVNzpqV1oPey8Pv0NFADCT7JIenut1rtWu8c1GrfxdJ5DijNZDTCHjQgrrN1mM7/6+0NHJMhwWMBWNSnGJtYpsTiZvU8NL9eHztweJL8zD5ztjvlQLcbO08LQ4vxoe4cOd3EvsVXVMLx1N2RTctot8+fD5neovtYtIvUThA0OtcvuruOsMU+ZN1MM7Mb+N2y7BuQ53TgHQ263TGGgD9QqGhrd+RnH63i8u5bOgqXyInUvufDeDFa0Hc11i9pDkGPxnETbMLUtcM+rnX5ruvpQspRTfLej/xqz7BfwV7F4Bk4JqTb/w6TT1o20V/HgF5H6sXZe2rsuxtlZki8qN/Zcoq3+nMPBXcLmkNATM5u81oPKt0bv8PxtgGJjT+Lfkaz2ckPgEAnzKLkX6mrmzq5+Vm4WX3cZI0O1c2lJ/4yNIca3iwAy3GoBxAQP++Mc/gofPH17nv4AfwcPn+xeFL3ez6M+pCfDpMum90/X/5dffeCb6m65clsAC2Pee+9NG9duUV7d8A/Vr9K4MTIBPFwQ/CEYp/ScF367mLi6+Os1vz8UvPUJRHb7h6EV1yZM7ksr3wJj2pu9ntwhjt8jDKI72OC3qkX/p8HuqDooSm4JDMXMcMCAwj5BXqyBIL0FRvUO6HNe+3KNfVKkvVfDjj/cm/IYgvpXzPClxBWVPW+I7S3FSzDUfH6V+yECKw5jij2yX2M9iFOBiAP6Zbu4m7SqifMH800dYn58eWfYrMBnmu8r/BQAA//9Y6a1NjiEAAA==" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ part {
          ~ content      = <<-EOT
                #cloud-config
                
                users:
                  - name: ec2-user
                    ssh_authorized_keys:
                      - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                      - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
                
                write_files:
                  - path: /tmp/cloud_init_vars
                    content: |
                      OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                      COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                      OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                      COMPOSER_HOST=external.staging.composer.osbuild.org
                      COMPOSER_ADDRESS=172.31.64.11
                      WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:service_keys-I2G3Wo
                      SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                      SYSTEM_HOSTNAME_PREFIX=staging-external-worker
                      COMPOSER_DIR=/etc/osbuild-composer
                      SECRETS_MANAGER_ENDPOINT_URL=https://secretsmanager.us-east-1.amazonaws.com/
                  - path: /etc/osbuild-composer/osbuild-composer.toml
                    content: |
                      [koji]
                      allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                
                      [worker]
                      allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                  - path: /etc/monitrc
                    content: |
                      # Monit configuration for Image Builder in AWS.
                      # Docs: https://mmonit.com/monit/documentation/monit.html
                
                      # Check every 30 seconds and log to syslog.
                      set daemon 30
                      set log syslog
                
                      # Allow access via ssh tunnel to see the monit console.
                      set httpd port 2812 and
                          use address localhost
                          allow admin:monit
                
                      # Verify that we're not eating all the memory on the instance.
                      CHECK SYSTEM $HOST
                        if memory usage > 75%
                          for 5 cycles
                          then exec /usr/local/bin/pozorbot_alert
                
                      # Ensure the root filesystem isn't full.
                      CHECK FILESYSTEM root PATH /
                        if space usage > 80%
                          for 5 times
                          within 15 cycles
                          then exec /usr/local/bin/pozorbot_alert
                
                      # Check to see if we can reach cdn.redhat.com.
                      # NOTE(mhayden): We will always get a 403 here because of client certs.
                      CHECK HOST rhel_cdn WITH ADDRESS cdn.redhat.com
                        if failed
                          ping
                          then exec /usr/local/bin/pozorbot_alert
                        if failed
                          port 443
                          protocol https
                          status = 403
                          with ssl options { CACERTIFICATEFILE: /etc/rhsm/ca/redhat-uep.pem }
                          then exec /usr/local/bin/pozorbot_alert
                  - path: /usr/local/bin/pozorbot_alert
                    content: |
                      #!/bin/bash
                      # Send alerts to pozorbot.
                      # Monit's environment variables are documented here:
                      # https://mmonit.com/monit/documentation/monit.html#ENVIRONMENT
                
                      QUEUE_URL=https://queue.amazonaws.com/933752197999/image-builder-pozorbot-staging
                      MESSAGE="🚨 $MONIT_EVENT for $MONIT_SERVICE on $MONIT_HOST at $MONIT_DATE"
                      RESULT=$(aws sqs send-message --queue-url $QUEUE_URL --message-body "$MESSAGE")
                      echo $RESULT
                
                  - path: /etc/vector/vector.toml
                    content: |
                      [sources.journald]
                      type = "journald"
                      exclude_units = ["vector.service"]
                
                      [sinks.out]
                      type = "aws_cloudwatch_logs"
                      inputs = [ "journald" ]
                      endpoint = "https://logs.us-east-1.amazonaws.com/"
                      group_name = "staging_external"
                      stream_name = "worker_syslog"
                      encoding.codec = "json"
                
                runcmd:
                  - chmod +x /usr/local/bin/pozorbot_alert
                  - chmod 0700 /etc/monitrc
                  - systemctl enable --now monit vector
            EOT -> (known after apply)
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
    }

  # data.template_cloudinit_config.internal_workers_cloud_init will be read during apply
  # (config refers to values not yet known)
 <= data "template_cloudinit_config" "internal_workers_cloud_init"  {
      ~ id            = "3130564300" -> (known after apply)
      ~ rendered      = "H4sIAAAAAAAA/9R52XLqSJ73PRH1DvlR/qK644xAC2Djblc0AolVArQCPR1EKpUgodRiKcV2+rzI3MztPN48woQEuLDPqdPLdMRE+cZW5n/LX/7XdDeOKI4oY5wS/AzCnFA/gSmth/4Ru38ATpxHLkxPL1VlqEji1FR7HW1ZrRRfjIXTzI+jZ8DV2B8qP1QY5p7oh8pNds/PkjjzaUkLKYXIC3FE/wA2PsERDPFL1Y98WkObbfUXLiOFUbbBKSNFKHb9aPsMHh2f3hGUJlN8pHVE4txlUBxt/O0PFcUP8VfG/XhPU6nkGU6z5woADCgseAYY8UyxWAEAgCzz1jCnXpz6Z+yuA3wqaYsfBlSzzGPSDIJOp9MRBfUMu9wJ8VLx2evMO2Kn0+l25t3jbiMPh6S/6UZtH5HBKbRTSUwNkyeTFg30vsHh5NHtzs4Hbrds2ZE3J7OFkuBZ6qtHdUH6T8ietuuanIgue27LB/X0KdhsvfYmP6nLRnv4SYGt6cmwxG3TU2P5uNEW/aY/oKiuz0nkSLI/TvSgQfwkbsxXVKThtvO6DfROq3f2TlunlTeVtn80hseGLe5yXWH7i/lZ3SV4c/Lt/FM21D55vJnOg3FHzPPhcu6kO/JJ9qwQTvbp/mRM+Tyb0n20FHeeMzucpo+8PdvBZOzW254BX2cSd5BPLVPmowVqzLYHduvPnVbmO7JxflQNfLSF5rz99JrMp7ayHKNku0qJDgeD8UpXPHqePiruKp1OZHMR61wHd06NrUeRmk5FgzhNfT97FM5n9lXUZB51p40pe0iah8PrzNsf+Ig6QmJMZtTFdPTJarLzWZREi5OuR6uEP8sHhHnOWRxbj5HXJpE3SVfbHX5E8TyadeRjHRGhJemj09bPZ0g8fAq4p2VOlsrCfIUiDQ6jSaDtesnOWPC4qYy4Vtx7zEYD1KjbzeC0mexdJbM895XrLgZ9y5om53jrsO2mtfRZbSEn0Uqrc9jaduvaJ9s60eVm+cSmG2uK3E7M91ebaNQ8LzVzMRq1lVUAo+NRkB7NqR9II7WdmTueZc+t7unEDjfDV8MZcWJz87hxBYi0dNLooaXpysM6J55UuyVzu0e08jv96WisOueFzBoC3TwdWczNX15ACHdx+qcUux6kNRSH1ff+jl2+2eTapc93Lz5PVr0hpxpSs1gbzkRuJ5NG0pIN0T8OjNZhGrQWT9GuvnrE8UydS3WFPYwbT80xiJ3chf47ZZVD6lO8LjLCNSwTSL1nUKdhcgnvdZEj1nuYZqVl6JIFnsFfr4ZOddEcTnrr7lRRhsbLk4Dg5ollcZNv8g2nwTU2j5ums2lCzLoCanM8empzbf7K3Z0qs6kuaTf2x00TCy3XbTeeuCa7gajhsEJLaKGWK7Qd57GFefzEuZuPyjvrrqQZLxOdpROd62qmOzJ8sadZI1M3V6M5K5taucfSbsCNdFOTLEntze3VYsXKgm6OxBVLLLOnzhV+eVYtsW8GTc7hVywOlabRC3it75kOr4kuq2m2mUwcLhnBwWpnBLKmmYfxnMiiy65eNctS5wEZzA3Z0kxZcNmjr7DNZCW7GeKSnrpY7RxbFfS+tzMC7nW+cGeWZLUMS1thk5MsQ13Avjo1FonoHpJir/FuL5AXhjXSXNaKbFOzTUuWNElm3VA56TvZswQvNfpsE1tJa86qoskSQZPllR7QvR2Q2A3Vabe0edQ1TVla8a5sSrJU0trtXvE9D2R1HompbclL3VKV5dmb2HaimhaJcCRqU1MVFW40UUJ3qPXE43Ihn93ddry0RjsrUHiVKM1V4B010zxC82jZ0pOg9EYa3llnyCexIiRHY0AG5s4TTLLcT3h1pNjDI9qJFrYSY8keocIhwbKS0/wQs2pPC5dCfDYWpOHIasvirJXJidE8IBPYd8XpQKaIJLpit8OlrZ3wwNKNLj07wUrSbdpQBJQuz/J4ZVm5EqqZIrtJl1is3RsNNG7V04irGry8XwVaastWT4usiT5wx6bt9o2BdtYlFdq2GrrEtXU5gWrQaLise1CIDG1j2FyePc5ZiK+K1Rmb0iqzJaWx6svQkDjPlomvGaKqLzRbkdShHomCxpLDMiK5YxHT6dKzFlm809P2Vp874UG8xwuvhSSNtwJuhgJ55MyThsNnAiIWtQZWoPUt2eRGXYN3RcWk3NLkdGtgefpC1JzzKHCE1XF87hy1cHmem42TZaqiy1ri3JanlsT1tYU7NC0idclKV6R2d06IrAWxsDJWS0UIDqt+O0N6e7wkq2QZkMTltdzkOqkacN2p5IqKZQX6wtVsk+suTbmv71yiku0ZG2Lg8Ifxr/CKN15t4cpzvy2Y5kqdm1x3bi8b346r45uPzreJqEUJr/KE6CxqOnIyQcHwZNgchJJ81CWiYPvoGQKxkYEE7Uy6hjUytUg92JHJKoOhoHGasGS12A23nGaqe12W/W54TF1DXKpme7liNd4eqF3Ub/f1wYhXJDrT7aOhctZYWSwPaj/b64RE9gClTj8xrYGyny6Sg7PzdCs8UjQw9xrLzQzDHJv2aGB26RTuLIjOVqixqwWUGoJhDDnTpta0Nxo7A4/ogZyZC2845489s281zEBVl4bcVBcdweo3o2lPnOjEZbElzqfzhDV5V51HHUG1LH1lP7GqaTZMKTnpUecMB2SvyqPG1BppGk9P2FZ1feGG88DjoeCperjKEa8Itt7mVZtw2s6jWOJa3Z3KLoO4OWaTpmbKnD6Ij8vA5ZCpLseCPDYtzXS7bc05L09u4C6WZtA0udVkSZTG0vKU+Xk0VSN5B+3REe3MxmqnSXowH+uRmhn6k4AGahPt5L260NhlMMpVEnDzhdLu+pecrJlNaSipskm0kRaQ3tzS5EsuZ8cfK8VgqhsvfkRxGkFSyyjc+tG2qGZJnOG0FmdO7hO3Fqfbj5ydXk+TdP2FY2sCW+Oeahx3JbGn2ljS1ro+WY+lpb7uaOoLTKNneMieM4xSTLMQRnCL0+c8YzDMKMM9twXhsclz7cd2u32lenZSfCj7VuZRNjEmV/m6KepdbTgzhlN1rXTUTv9a8jpq759XluVOhlI/KTp85srCoDgMYeQywXxJ4vZN/1I3JKWETu0o0nqmSfJw8XIFj7mhyRziNLj24ne49YbaSx1TVL9iy9zAvkmXuppk6G8Hk9TebDpUjbWpTV48SpPsuV7fJwgzrMsJXLMhsK1mo+1wyGXa52P6eG7ua+9PXns7ea1grMEQnuMIHrLiouv3jcq37PpqoUbjkHy7f/lzEO/8v1w/ICHxAbtrNw6hH2XgBfwZVCmG4b1bVf8NVL3cqRV3/XH9AuDXW+CmAUHwAqrfthpBBqW0luCiMbtadxH4D9v3L7PjA9JhHPk0Rd+G8kegFNvgMuzlKSwcE2ziFAxDuMVALNTgFPgR6Nh67Y2rF6PsGdwcJSx1lPdc/lV3Y5QXg2sp7rJW82hIKm8Cuh5GAcB7nJ6AwIIMozhyMwAjF5B4C2gMslNG4u1NZYYpcCEO4wgI7N1aQXyh/EV2p4AcQIRwloG9D4shFdA8ijApBWMMqIdBeDt5FhN8r6c4lguSOKWAf+L4wqjrbvGTZxhA100L4SRGkHhxRu/24UW7G/rRc6niF8MsnPqbE6AepOCAf0oxiGIKMKR+tC34LmbhME5PII7KLz/KKIzQm33dgdQdX5MDeCiyw5tqf3PjzbPi7n4Gj83/f2dYcatNgE6I4OxumXo4AviIEajnWVovj1R3/KiexOc4dWK6hgSnd6eQoixPLxCmcUzLt4nslFEcAj+LfqJgkxPy3l55OJGuNpcss44xAPV7y7MEIvxm+BP7teHUD9/ZffCp50eA+1cc6eKNV9/wN+CAAYIRSDFEHkBuVPtlAPslBtSpIf0u9ODJxdHvn4GNwcEnBEBygKcMbDEFEDRYAXg4xcDBCBaeE28AIj6OKEA4pdl7mIrrBKmHyRq5EbCHxgBcC+AHI+6R20Cf4HsHTfxo+0+A8V2RRSw0GsL9UhrTGMXkkgTuNjIKaV7kuQYrfLgukGUExGXxy8Bn0O0UE+BQHnY7hlS4yDVjpV4W1hGsX87L5DgpEhv48k8d6i0X/s3Df50c/19J6sDMe7t0HUcuKHmywl9uYmrv8+lPGcDR3k/jqMiCYA9THzoEZwCmGNySI3ZL13h+Y/2H0+mPkmoNtamqSKpxc+a5KZnSuzL+muP8Yzm+703qfpHqGeeS6pnbkZhrq3GVq0i63ulLL9X//s//+C/woEzVobEuJnKjjM/rgi5p1rArFdnrulL6NKS3z17HkG4PJpqkmxPj5eF38JCB7DUDGY5cJsRZmQUYpjScyVMCHt5OBZgbAePE7glUH66GVX9/lYqRF4OHi+zKx2K4x4jG6fXX91qMLM5ThLPaLs6LNsu9FWF6SnBRhm/rt7PgIyK5i9d55NOyyFevOjKc7n2Eq3956w8yPwqyWpzTjzLhIVuXDzgHSJG3JvE2u4n3oySn1+bhTfVbZ4AjN4n9iBZC3jdvHGYFzoFNVhCgw6Img1/32/i452uF9O+3bDfd2zTOk3UEw9LIq1esbw3ojSqjKYbhG9mlm1lfSvMbSNf36RqKXYxKGLM4qlYqaR6h0L28ZiEvjF3w6fh3RPaFlH1k2Y+tDgMuFQlRAnBUxB5gmCg+XIv+5W6+8xD/jzypH5nMw4Rc+vpfe1O/SyVFi8HgPAaJn+Ai1VYuzvbtF7zKj6CP6bteAAx7tcpQ1Y2O2pXWw97Lw+9QESXMJCtzyHO9zrXaNb7ZqF1/1wmkOKP1EFPIuJDC+k0W47u/L3R0sgyHBUxFN1NcYq0im5PJ2/zxUn34/O2R5Avz8PnOmC/VQtwsLdwxzi+GR/hwJ7cM0KqOadn2XDuH23aRVB8+v1P9pVaK1K8ofGCoVW5/FXedYcq8iXp4J+a3cdtXcC5jolMA9HbrNAbaQL2AoeGtn1GcvveLssYWNJUPsVMm2HfTWtGfMJclZg9JjsG/F2HD3FLJJe1+/t6c+OXKcpXiuwX935iav4C/gt0rYFJQrekln05TP9pWwc8XQO4H5PXV1vV1QK4V2aJyY/8eZfXvFAb+CspLSkPAbP5eAyrfGuKv/60DDANzGv+WfK2HExKfQIBPWVnJL5k7u/jZdbPwstusCbqdsnf1Nz6CFNcqDsxwqwEYFzDgj3/8I3j4/OGN/wv4GTx8vn+b+HI3sP6amgCfynHwna7/K7/+xmvT33TlawksgH3vub9sVL9NeXHLN1C/Ru/CwAT4VCL4QTBK6f9S8O1q7uLiq9P89ly87BGK6vANRy+qS57ckVR+BMa0N30/4EUYu0UeRnG0x2lRj/xyDOipOihKbAoOxWBywIDAPEJerYIgLYOieof0dab7co9+UaW+VMHPP9+b8BuC+FbO8+SKK7g2vld8ZylOiuHn48vVTxlIcRhT/JGtjP0sRgEupuRf6eZu0i4irm+hf/oI6/PTI8t+BSbD/FD5nwAAAP//gR822tQhAAA=" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ part {
          ~ content      = <<-EOT
                #cloud-config
                
                users:
                  - name: ec2-user
                    ssh_authorized_keys:
                      - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                      - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
                
                write_files:
                  - path: /tmp/cloud_init_vars
                    content: |
                      OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                      COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                      OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                      COMPOSER_HOST=internal.staging.composer.osbuild.org
                      COMPOSER_ADDRESS=10.30.18.11
                      WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
                      SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                      SYSTEM_HOSTNAME_PREFIX=staging-internal-worker
                      COMPOSER_DIR=/etc/osbuild-composer
                      SECRETS_MANAGER_ENDPOINT_URL=https://vpce-0d13154306549b1cd-9zxr7z5v.secretsmanager.us-east-1.vpce.amazonaws.com/
                  - path: /etc/osbuild-composer/osbuild-composer.toml
                    content: |
                      [koji]
                      allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                
                      [worker]
                      allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                  - path: /etc/monitrc
                    content: |
                      # Monit configuration for Image Builder in AWS.
                      # Docs: https://mmonit.com/monit/documentation/monit.html
                
                      # Check every 30 seconds and log to syslog.
                      set daemon 30
                      set log syslog
                
                      # Allow access via ssh tunnel to see the monit console.
                      set httpd port 2812 and
                          use address localhost
                          allow admin:monit
                
                      # Verify that we're not eating all the memory on the instance.
                      CHECK SYSTEM $HOST
                        if memory usage > 75%
                          for 5 cycles
                          then exec /usr/local/bin/pozorbot_alert
                
                      # Ensure the root filesystem isn't full.
                      CHECK FILESYSTEM root PATH /
                        if space usage > 80%
                          for 5 times
                          within 15 cycles
                          then exec /usr/local/bin/pozorbot_alert
                
                      # Check to see if we can reach cdn.redhat.com.
                      # NOTE(mhayden): We will always get a 403 here because of client certs.
                      CHECK HOST rhel_cdn WITH ADDRESS cdn.redhat.com
                        if failed
                          ping
                          then exec /usr/local/bin/pozorbot_alert
                        if failed
                          port 443
                          protocol https
                          status = 403
                          with ssl options { CACERTIFICATEFILE: /etc/rhsm/ca/redhat-uep.pem }
                          then exec /usr/local/bin/pozorbot_alert
                  - path: /usr/local/bin/pozorbot_alert
                    content: |
                      #!/bin/bash
                      # Send alerts to pozorbot.
                      # Monit's environment variables are documented here:
                      # https://mmonit.com/monit/documentation/monit.html#ENVIRONMENT
                
                      QUEUE_URL=https://queue.amazonaws.com/933752197999/image-builder-pozorbot-staging
                      MESSAGE="🚨 $MONIT_EVENT for $MONIT_SERVICE on $MONIT_HOST at $MONIT_DATE"
                      RESULT=$(aws sqs send-message --queue-url $QUEUE_URL --message-body "$MESSAGE")
                      echo $RESULT
                
                  - path: /etc/vector/vector.toml
                    content: |
                      [sources.journald]
                      type = "journald"
                      exclude_units = ["vector.service"]
                
                      [sinks.out]
                      type = "aws_cloudwatch_logs"
                      inputs = [ "journald" ]
                      endpoint = "https://vpce-01e031ba5033ab0c5-eqvgoxv2.logs.us-east-1.vpce.amazonaws.com/"
                      group_name = "staging_internal"
                      stream_name = "worker_syslog"
                      encoding.codec = "json"
                
                runcmd:
                  - chmod +x /usr/local/bin/pozorbot_alert
                  - chmod 0700 /etc/monitrc
                  - systemctl enable --now monit vector
            EOT -> (known after apply)
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
    }

  # data.template_file.external_workers_cloud_config will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "external_workers_cloud_config"  {
      ~ id       = "aead6dee8589ba9c248d96da216e73a6d54bb65f200c3739bde35c317d575e15" -> (known after apply)
      ~ rendered = <<-EOT
            #cloud-config
            
            users:
              - name: ec2-user
                ssh_authorized_keys:
                  - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                  - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
            
            write_files:
              - path: /tmp/cloud_init_vars
                content: |
                  OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                  COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                  OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                  COMPOSER_HOST=external.staging.composer.osbuild.org
                  COMPOSER_ADDRESS=172.31.64.11
                  WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:service_keys-I2G3Wo
                  SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                  SYSTEM_HOSTNAME_PREFIX=staging-external-worker
                  COMPOSER_DIR=/etc/osbuild-composer
                  SECRETS_MANAGER_ENDPOINT_URL=https://secretsmanager.us-east-1.amazonaws.com/
              - path: /etc/osbuild-composer/osbuild-composer.toml
                content: |
                  [koji]
                  allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
            
                  [worker]
                  allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
              - path: /etc/monitrc
                content: |
                  # Monit configuration for Image Builder in AWS.
                  # Docs: https://mmonit.com/monit/documentation/monit.html
            
                  # Check every 30 seconds and log to syslog.
                  set daemon 30
                  set log syslog
            
                  # Allow access via ssh tunnel to see the monit console.
                  set httpd port 2812 and
                      use address localhost
                      allow admin:monit
            
                  # Verify that we're not eating all the memory on the instance.
                  CHECK SYSTEM $HOST
                    if memory usage > 75%
                      for 5 cycles
                      then exec /usr/local/bin/pozorbot_alert
            
                  # Ensure the root filesystem isn't full.
                  CHECK FILESYSTEM root PATH /
                    if space usage > 80%
                      for 5 times
                      within 15 cycles
                      then exec /usr/local/bin/pozorbot_alert
            
                  # Check to see if we can reach cdn.redhat.com.
                  # NOTE(mhayden): We will always get a 403 here because of client certs.
                  CHECK HOST rhel_cdn WITH ADDRESS cdn.redhat.com
                    if failed
                      ping
                      then exec /usr/local/bin/pozorbot_alert
                    if failed
                      port 443
                      protocol https
                      status = 403
                      with ssl options { CACERTIFICATEFILE: /etc/rhsm/ca/redhat-uep.pem }
                      then exec /usr/local/bin/pozorbot_alert
              - path: /usr/local/bin/pozorbot_alert
                content: |
                  #!/bin/bash
                  # Send alerts to pozorbot.
                  # Monit's environment variables are documented here:
                  # https://mmonit.com/monit/documentation/monit.html#ENVIRONMENT
            
                  QUEUE_URL=https://queue.amazonaws.com/933752197999/image-builder-pozorbot-staging
                  MESSAGE="🚨 $MONIT_EVENT for $MONIT_SERVICE on $MONIT_HOST at $MONIT_DATE"
                  RESULT=$(aws sqs send-message --queue-url $QUEUE_URL --message-body "$MESSAGE")
                  echo $RESULT
            
              - path: /etc/vector/vector.toml
                content: |
                  [sources.journald]
                  type = "journald"
                  exclude_units = ["vector.service"]
            
                  [sinks.out]
                  type = "aws_cloudwatch_logs"
                  inputs = [ "journald" ]
                  endpoint = "https://logs.us-east-1.amazonaws.com/"
                  group_name = "staging_external"
                  stream_name = "worker_syslog"
                  encoding.codec = "json"
            
            runcmd:
              - chmod +x /usr/local/bin/pozorbot_alert
              - chmod 0700 /etc/monitrc
              - systemctl enable --now monit vector
        EOT -> (known after apply)
      ~ template = <<-EOT
            #cloud-config
            
            users:
              - name: ec2-user
                ssh_authorized_keys:
                  - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                  - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
            
            write_files:
              - path: /tmp/cloud_init_vars
                content: |
                  OSBUILD_COMMIT=${osbuild_commit}
                  COMPOSER_COMMIT=${composer_commit}
                  OSBUILD_CA_CERT=${osbuild_ca_cert}
                  COMPOSER_HOST=${composer_host}
                  COMPOSER_ADDRESS=${composer_address}
                  WORKER_SSL_KEYS_ARN=${worker_ssl_keys_arn}
                  SUBSCRIPTION_MANAGER_COMMAND_ARN=${subscription_manager_command}
                  SYSTEM_HOSTNAME_PREFIX=${system_hostname_prefix}
                  COMPOSER_DIR=/etc/osbuild-composer
                  SECRETS_MANAGER_ENDPOINT_URL=https://${secrets_manager_endpoint_domain}/
              - path: /etc/osbuild-composer/osbuild-composer.toml
                content: |
                  [koji]
                  allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
            
                  [worker]
                  allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
          -   - path: /etc/monitrc
          -     content: |
          -       # Monit configuration for Image Builder in AWS.
          -       # Docs: https://mmonit.com/monit/documentation/monit.html
          - 
          -       # Check every 30 seconds and log to syslog.
          -       set daemon 30
          -       set log syslog
          - 
          -       # Allow access via ssh tunnel to see the monit console.
          -       set httpd port 2812 and
          -           use address localhost
          -           allow admin:monit
          - 
          -       # Verify that we're not eating all the memory on the instance.
          -       CHECK SYSTEM $HOST
          -         if memory usage > 75%
          -           for 5 cycles
          -           then exec /usr/local/bin/pozorbot_alert
          - 
          -       # Ensure the root filesystem isn't full.
          -       CHECK FILESYSTEM root PATH /
          -         if space usage > 80%
          -           for 5 times
          -           within 15 cycles
          -           then exec /usr/local/bin/pozorbot_alert
          - 
          -       # Check to see if we can reach cdn.redhat.com.
          -       # NOTE(mhayden): We will always get a 403 here because of client certs.
          -       CHECK HOST rhel_cdn WITH ADDRESS cdn.redhat.com
          -         if failed
          -           ping
          -           then exec /usr/local/bin/pozorbot_alert
          -         if failed
          -           port 443
          -           protocol https
          -           status = 403
          -           with ssl options { CACERTIFICATEFILE: /etc/rhsm/ca/redhat-uep.pem }
          -           then exec /usr/local/bin/pozorbot_alert
          -   - path: /usr/local/bin/pozorbot_alert
          -     content: |
          -       #!/bin/bash
          -       # Send alerts to pozorbot.
          -       # Monit's environment variables are documented here:
          -       # https://mmonit.com/monit/documentation/monit.html#ENVIRONMENT
          - 
          -       QUEUE_URL=https://queue.amazonaws.com/933752197999/image-builder-pozorbot-staging
          -       MESSAGE="🚨 $MONIT_EVENT for $MONIT_SERVICE on $MONIT_HOST at $MONIT_DATE"
          -       RESULT=$(aws sqs send-message --queue-url $QUEUE_URL --message-body "$MESSAGE")
          -       echo $RESULT
          - 
              - path: /etc/vector/vector.toml
                content: |
                  [sources.journald]
                  type = "journald"
                  exclude_units = ["vector.service"]
            
                  [sinks.out]
                  type = "aws_cloudwatch_logs"
                  inputs = [ "journald" ]
                  endpoint = "https://${cloudwatch_logs_endpoint_domain}/"
                  group_name = "${cloudwatch_log_group}"
                  stream_name = "worker_syslog"
                  encoding.codec = "json"
            
            runcmd:
          -   - chmod +x /usr/local/bin/pozorbot_alert
          -   - chmod 0700 /etc/monitrc
          -   - systemctl enable --now monit vector
          +   - systemctl enable --now vector
        EOT
      ~ vars     = {
          ~ "composer_address"                = "172.31.64.11" -> (known after apply)
            # (10 unchanged elements hidden)
        }
    }

  # data.template_file.internal_workers_cloud_config will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "internal_workers_cloud_config"  {
      ~ id       = "2a904cfbb070bd7460dff0f55648390d237b8b543ba78663ea60c8a38f3519ee" -> (known after apply)
      ~ rendered = <<-EOT
            #cloud-config
            
            users:
              - name: ec2-user
                ssh_authorized_keys:
                  - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                  - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
            
            write_files:
              - path: /tmp/cloud_init_vars
                content: |
                  OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                  COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                  OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                  COMPOSER_HOST=internal.staging.composer.osbuild.org
                  COMPOSER_ADDRESS=10.30.18.11
                  WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
                  SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                  SYSTEM_HOSTNAME_PREFIX=staging-internal-worker
                  COMPOSER_DIR=/etc/osbuild-composer
                  SECRETS_MANAGER_ENDPOINT_URL=https://vpce-0d13154306549b1cd-9zxr7z5v.secretsmanager.us-east-1.vpce.amazonaws.com/
              - path: /etc/osbuild-composer/osbuild-composer.toml
                content: |
                  [koji]
                  allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
            
                  [worker]
                  allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
              - path: /etc/monitrc
                content: |
                  # Monit configuration for Image Builder in AWS.
                  # Docs: https://mmonit.com/monit/documentation/monit.html
            
                  # Check every 30 seconds and log to syslog.
                  set daemon 30
                  set log syslog
            
                  # Allow access via ssh tunnel to see the monit console.
                  set httpd port 2812 and
                      use address localhost
                      allow admin:monit
            
                  # Verify that we're not eating all the memory on the instance.
                  CHECK SYSTEM $HOST
                    if memory usage > 75%
                      for 5 cycles
                      then exec /usr/local/bin/pozorbot_alert
            
                  # Ensure the root filesystem isn't full.
                  CHECK FILESYSTEM root PATH /
                    if space usage > 80%
                      for 5 times
                      within 15 cycles
                      then exec /usr/local/bin/pozorbot_alert
            
                  # Check to see if we can reach cdn.redhat.com.
                  # NOTE(mhayden): We will always get a 403 here because of client certs.
                  CHECK HOST rhel_cdn WITH ADDRESS cdn.redhat.com
                    if failed
                      ping
                      then exec /usr/local/bin/pozorbot_alert
                    if failed
                      port 443
                      protocol https
                      status = 403
                      with ssl options { CACERTIFICATEFILE: /etc/rhsm/ca/redhat-uep.pem }
                      then exec /usr/local/bin/pozorbot_alert
              - path: /usr/local/bin/pozorbot_alert
                content: |
                  #!/bin/bash
                  # Send alerts to pozorbot.
                  # Monit's environment variables are documented here:
                  # https://mmonit.com/monit/documentation/monit.html#ENVIRONMENT
            
                  QUEUE_URL=https://queue.amazonaws.com/933752197999/image-builder-pozorbot-staging
                  MESSAGE="🚨 $MONIT_EVENT for $MONIT_SERVICE on $MONIT_HOST at $MONIT_DATE"
                  RESULT=$(aws sqs send-message --queue-url $QUEUE_URL --message-body "$MESSAGE")
                  echo $RESULT
            
              - path: /etc/vector/vector.toml
                content: |
                  [sources.journald]
                  type = "journald"
                  exclude_units = ["vector.service"]
            
                  [sinks.out]
                  type = "aws_cloudwatch_logs"
                  inputs = [ "journald" ]
                  endpoint = "https://vpce-01e031ba5033ab0c5-eqvgoxv2.logs.us-east-1.vpce.amazonaws.com/"
                  group_name = "staging_internal"
                  stream_name = "worker_syslog"
                  encoding.codec = "json"
            
            runcmd:
              - chmod +x /usr/local/bin/pozorbot_alert
              - chmod 0700 /etc/monitrc
              - systemctl enable --now monit vector
        EOT -> (known after apply)
      ~ template = <<-EOT
            #cloud-config
            
            users:
              - name: ec2-user
                ssh_authorized_keys:
                  - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                  - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
            
            write_files:
              - path: /tmp/cloud_init_vars
                content: |
                  OSBUILD_COMMIT=${osbuild_commit}
                  COMPOSER_COMMIT=${composer_commit}
                  OSBUILD_CA_CERT=${osbuild_ca_cert}
                  COMPOSER_HOST=${composer_host}
                  COMPOSER_ADDRESS=${composer_address}
                  WORKER_SSL_KEYS_ARN=${worker_ssl_keys_arn}
                  SUBSCRIPTION_MANAGER_COMMAND_ARN=${subscription_manager_command}
                  SYSTEM_HOSTNAME_PREFIX=${system_hostname_prefix}
                  COMPOSER_DIR=/etc/osbuild-composer
                  SECRETS_MANAGER_ENDPOINT_URL=https://${secrets_manager_endpoint_domain}/
              - path: /etc/osbuild-composer/osbuild-composer.toml
                content: |
                  [koji]
                  allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
            
                  [worker]
                  allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
          -   - path: /etc/monitrc
          -     content: |
          -       # Monit configuration for Image Builder in AWS.
          -       # Docs: https://mmonit.com/monit/documentation/monit.html
          - 
          -       # Check every 30 seconds and log to syslog.
          -       set daemon 30
          -       set log syslog
          - 
          -       # Allow access via ssh tunnel to see the monit console.
          -       set httpd port 2812 and
          -           use address localhost
          -           allow admin:monit
          - 
          -       # Verify that we're not eating all the memory on the instance.
          -       CHECK SYSTEM $HOST
          -         if memory usage > 75%
          -           for 5 cycles
          -           then exec /usr/local/bin/pozorbot_alert
          - 
          -       # Ensure the root filesystem isn't full.
          -       CHECK FILESYSTEM root PATH /
          -         if space usage > 80%
          -           for 5 times
          -           within 15 cycles
          -           then exec /usr/local/bin/pozorbot_alert
          - 
          -       # Check to see if we can reach cdn.redhat.com.
          -       # NOTE(mhayden): We will always get a 403 here because of client certs.
          -       CHECK HOST rhel_cdn WITH ADDRESS cdn.redhat.com
          -         if failed
          -           ping
          -           then exec /usr/local/bin/pozorbot_alert
          -         if failed
          -           port 443
          -           protocol https
          -           status = 403
          -           with ssl options { CACERTIFICATEFILE: /etc/rhsm/ca/redhat-uep.pem }
          -           then exec /usr/local/bin/pozorbot_alert
          -   - path: /usr/local/bin/pozorbot_alert
          -     content: |
          -       #!/bin/bash
          -       # Send alerts to pozorbot.
          -       # Monit's environment variables are documented here:
          -       # https://mmonit.com/monit/documentation/monit.html#ENVIRONMENT
          - 
          -       QUEUE_URL=https://queue.amazonaws.com/933752197999/image-builder-pozorbot-staging
          -       MESSAGE="🚨 $MONIT_EVENT for $MONIT_SERVICE on $MONIT_HOST at $MONIT_DATE"
          -       RESULT=$(aws sqs send-message --queue-url $QUEUE_URL --message-body "$MESSAGE")
          -       echo $RESULT
          - 
              - path: /etc/vector/vector.toml
                content: |
                  [sources.journald]
                  type = "journald"
                  exclude_units = ["vector.service"]
            
                  [sinks.out]
                  type = "aws_cloudwatch_logs"
                  inputs = [ "journald" ]
                  endpoint = "https://${cloudwatch_logs_endpoint_domain}/"
                  group_name = "${cloudwatch_log_group}"
                  stream_name = "worker_syslog"
                  encoding.codec = "json"
            
            runcmd:
          -   - chmod +x /usr/local/bin/pozorbot_alert
          -   - chmod 0700 /etc/monitrc
          -   - systemctl enable --now monit vector
          +   - systemctl enable --now vector
        EOT
      ~ vars     = {
          ~ "composer_address"                = "10.30.18.11" -> (known after apply)
            # (10 unchanged elements hidden)
        }
    }

  # aws_instance.composer_external must be replaced
-/+ resource "aws_instance" "composer_external" {
      ~ arn                          = "arn:aws:ec2:us-east-1:933752197999:instance/i-0418ebc127d387b16" -> (known after apply)
      ~ associate_public_ip_address  = true -> (known after apply)
      ~ availability_zone            = "us-east-1f" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-0418ebc127d387b16" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      + key_name                     = (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-02f250427cdd85dc7" -> (known after apply)
      ~ private_dns                  = "ip-172-31-64-11.ec2.internal" -> (known after apply)
      ~ private_ip                   = "172.31.64.11" -> (known after apply)
      ~ public_dns                   = "ec2-34-234-177-181.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                    = "34.234.177.181" -> (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [
          - "external_composer_staging",
        ] -> (known after apply)
      - source_dest_check            = true -> null
      ~ subnet_id                    = "subnet-0c016a02" -> (known after apply)
        tags                         = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🏗 External Composer (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ tenancy                      = "default" -> (known after apply)
      ~ user_data_base64             = "H4sIAAAAAAAA/9Ra6XLjyJH+z4h5h7JGG2NHGyTAQxI1I4d5ADxEgCJOkl4Ho4AqEiAKBTSqwKunX2T/7N99vH2EDYBHU2r1HA5HrK0/JAqZWZlZmVlfJtWJKceUC+Y+wY8gyggPEpjyShTsMPoRuHFGEUz3TzfqQJXbY0vrtvTZTSl/EmycsiCmj0Aqi9+VvisJwjXRd6Wz7G7AkpgFvKCFnEPPjzDlP4JlQDCFEX66CWjAy95ydfOFy0whZUucCjL1YhTQ1SO4dwN+RVCozPGOVzwSZ0jwYroMVt+V1CDCXyn3/TVNqZQxnLLHEgACyDV4BNirCvliCQAAGPMXMON+nAYHjBYh3he0+Z8AbhjzhZRB0Gq1Wu2adoAdae9V5fyx25q02q1Wq9OadHbrpTIYkN6yQ5uBR/r7yEnldmpaVTK646HRMyWc3KPOy2ErrWd3DvUn5GWqJvglDbSdNiW9B88ZNyu6krSReGgqW23/IVyu/OYy22uzenPwQYV3471pt1cNX4uV3VKf9hpBn3sVY0KoKyvBc2KEdRIkcX0y520erVofV6HRuuse/P3KvcsaajPYmYNd3WmvM0MVe9PJQVsneLkPnOwDG+gf/KqVTsLnVjvLBrOJm67JB8W3IzjapJu9Oa5mbMw3dNZe++7Ldj++rzova5g8o0rTN+HHF1naKvs7S6nSqVd/WW3FVTBx71jgKubhXjPxzqk1Js2Hj8lk7KizZy9ZzVNiwH7/eW6oPj+M71U0T8cjxZrGhtTCrX195XNPS8dtk7gNY/NyXzscxI9tXal6nXF9LG6Txnb78cXfbKuUu7XEHL1whPnwg90QJy80odO9YdB5Uj0oWw9XJXe6u7unfpNQf5TOV2t878UT+tJSdhWP1O5kY7hfBdmL195+CKWHWUZm6tT6CNs83A5Hob7uJmtzWsUNdSjdxd17Nux79YrTCPfL0QapzPbRR6kz7fdse5wc4pUrNhv2LBD1qZLQuV6RsL3qVPQPjr3ns+XsQUyX9thDrbjamy/psHGY6dZ0OGyq8xDS3a4m31vjIJSHWpNZ66ooHu46+704WA4+mu5QajeW90tUg56ejupdb2YhZVCR2nvNuVOk9b03D1q98fBZcw9TRTRrfPmwE7E0eXoCEVzH6V9TjHzIy14c3byOd4yqjYbULGK+c4x5Mu8OJM2UG/na4KUtrRVST+4Usx3s+ubddhzeTR/oujK/x/GLNpErqrh9rj80nkHsZggGrzYrbdOA40VeEU5pmUDuP4IKj5Jjei/yGrHYwJQVmnnHKvAIfj4pOjba1mDUXXTGqjownx5qHlw+iCJuVBvVuluX6sv7ZcNdNiAWUc1rSlXvoSk1qyfuzlh9GRuyfma/XzZw7Q6hZv1BaohL6NVdsXZXu/PuUK3puvd3uIofJLR8u3lr0ZF182lkiHxkSB3dQkMzaHd1e2gZ1nw4ERVLL96JvBNKQ8PSZVvWuhNnPp2LSs2whu25SGyrq03U6uyg2e2eFTYktzoXcaQ2zG5Y1Xu+5Vb1NhJ13bGSkSslQ9ifr81Q0XVr+zwhShuJ84+6bWuTkPQnpmLrllJD4i5QxUYyVxDzpKSrTedr19FqRs9fm6H0cTJFL7Zs35m2PseWJNumNoU9bWxOkzbaJvm7+qt3oTI17aGORJs6lu5YtiLrsiKiSN0ba8W3a35q9sQGtpO7iai1LZHUdEWZGyHfOCGJUaSNO4XOw45lKfK8ihRLVuSC1ml28+dJqGgT2k4dW5kZtqbODv7IcRLNsgnFtK2PLa2tSsORGqGB3m3vZlPlgNar55k9XNuhWtWI2piH/k63rB20drYjP9TU7lDHa/sAq0ms1pKd2Sd9a+3XLDLbjKraUHUGO2/dtrGdmDNxB1XJq9l2sp9sY1Hr6tGsFh/MKam7inZnS/bcktp0EpIR7KH2uK9wjySG6jSjmaPvcd82zA4/uOFcNhxeV2teOjsoz3PbztRIY6qCkg6xRac77OvSvKsTpJlVZTMP9dRR7K5O7ZHRR8+Wg3pmXz8YsgYdR4sQQY6hJFAL63Ukoq1KFOiYg8bs4EvutP1RtVvPljxnjqzW5z0FmrLkOwoJdLOtGVPdUWVtYNB2TRfJdkZJ5trEcjv8oFO76nb1jd2T9rgfb/DUv/NkvWqH0osXKkN3ktTdKqt5xOZ23w71nq1Y0rBjVlFbtbg0syTD7tu+MW3r7mEYurX57vnQ2unR7DCx6nvb0tpItNsTRxnbstTTp2hg2UTukLmhys3OhBBFD+Pa3JzP1Fq4nfeazDOazzMyT2YhSVBVzyyplWqh1BnLqK3admhMke5YUmdmKT1jjYhGVgdstkO3un3+Bm/7zKtPkTIJmjXLmmsTS+pMnFn9/bzaXWJ0skraOk2qWpUQQ/QarpKMvHCwNx0JQlnZGTJRsbPzzRpxPNOr6QfSMe2hpVNt61BLVPuDmi7ptZmoxyhaSbqlbQxFCTrRLkVme6ZZzdlc1KtOX+t4vWbP6A+rqsxfDGdnapL9rE5nW63HNgYh1Ol7qdtLLLuvbsbTZOuufcOOdtzrWxtdlF5M03q2nGHf6vAxXNvQO9iRLs6nUK7XTHMgWQ63x93hs9v3iREqzJr6g0l117V6dt0KNW1mKg1t2qrZvQYdd9sjgyAR2+3JeJKIVhVpE9qqabZtzJ0HUbOsuiUne4O2DrBPNpoyrI/toa5X+R47mmFMUTQJ/Sqs+ZoRzTOvqtYco1nVHCLpa59jWbrrrDVxFsaNZzFp6JYiGf14NwuR5Fna7LmmPFu2bqFOU3cPsz0K0XRmhQ1Lmo9mRK3PbF+dHIZjjSpr6Ax33tqqz9e6bISTZ4NqzDQeal5fa3hrZaNNdXEWDjONhNJkqjY7wbEm61ZDHsiaYhF9qIekO7F15VjLxee3N4VhjBbP8sxYtHTtCab0EW7ZI8NeijmLIIUrnD5mTMCQcUF6bNZq942q1LxvNpsnqke84zilkCy8OEpihtMCaQqrhiyuzNN2htU2OvrgxRyMtYXa0lq90yXV0rr/+M4sc5mXBkmOyYUTi+DFUQQpEsLJjMTN8/4zw5TVRX9smFpLlRcvuqwMpk+Mw1VAV8LZBOFswlsvdQf6UwVzrxIzNwsIektoyB1dNo2LabLWfRkPNHNh6aMnn/OEPVYqr20rX2wrwwgeYgq3LEcRlWvc8N6WXy2UeRyR9+HE38J4Hfz99AAJibcYLVAcwYAy8AT+Bm44hlH5JLEcp6ubP4MbP3PLboq3b9e3cRri9OtX4LyDB8ETuHlfaw8KXsrLCc5x0km7o8Dfrd8/TY83no5iGvDUe9+V3wM1fw2OvVeWwjzqwDJOwSCCKwza+TY4BQEFLccoX7i6sccewTkGomKP4pyLbxUUe1neRxbijmtln0ekdBHQ8bEXArzB6R7URMCwF1PEAKQIkHgFeAzYnpF4dd6SYQ4QxFFMQU28WsuJj5RfZLdylwPoeZgxsAlg3jMCnlGKSSEYY8B9DKKz5Swm+Hqf3CwEkjjloPogVXOlTm/zv4xhABFKc+Ek9iDxY8av3sPj7igK6GOxxRfFbJwGyz3gPuRgi39IMaAxBxjygK5yvqNaOIrTPYhp8RRQxiH1Lvp1+nLn+ZT54DZP/cvWwfLMm7H87P4C7hv/caVYfqoN4O09gtnVMvcxBXiHPVDJWFopTKq4Aa0k8SFO3ZgvIMHplRUyZVl6dGEax7wYFbA94zgCAaM/cLDMCHmtrzIYySedC5aXltkHlWvNWQI9fFH8QfxacR5Er/TeBtwPKJD+ySa9Ta3fad7lukhwygKWZ9vJ2g1MKyRwv1Vs/wW8cMzJU4YES7DFwIMUpBh6PvAQLX/pCr9UAm1syn+MfLhHmP7pETgYbANCACRbuGdghTmAoC7WgI9TDFzswTx/4iXwSJD7xsMpZ6+9mQc1SH1MFh6iwBmYfdDqdnXZMN4oce25JQwIvk7TJKCrf8AZvygyrwj1eu16KY157MXkWAqvXjAOeZZX+7pYe3NcgDEC4uJ+Z+AT6LTytnSgDDotU84j6VS3U59FFQ9WjvYKGU7y8g4+/0NGXW6EXzX+6yviDwWpC5l/OXQDUwQKHpbHy1lM+fWt8gMDmG6CNKb5XQA2MA2gSzADMMXgfEVgVITG44X1d18q38uaPdDHmipr5jmYJ5Zsya9wyscMZ/gNKLmGX5Ugv/AE93jhCWeThBOaOslVZcNo9eSnm//97//6H3CrjrWBuZBtWTOL/DwtGLJuDzpyXsNPK0VMQ35+7LZM+TzF0WXDGplPt3+EWwbYRwYYpkiIMCuqgCAUigtZSsDtxSognAkEN0Z7cHN7UuzmTyep2PNjcHuUXXoLCTbY43F6+vgloMXiLPUwK6/jLEeS6AxF+D7BORg5r59twTuPZAgvMhrwAurcnPZgON0EHr75+wUlsYCGrBxn/K1MuGWLYqq0hdzzFyResbP4gCYZP0Goy9YXfIQpSuKA8lzI+dRz7m9i0rPYVRpnyYLCqNj/dOCLM3w+UzGeYhhdyC6F/og+Lh44TcTLXoywV/iIxfSmVEoz6kXoOD/z/ChG4MPuN6TtkVS8F8W3aE4Ax1vJ4wRgmicWEAQab0+45uj4Xxj9/54h/k5gPibk2Jd8a4p/VSdyFCXgLAZJkOC8jpaOkfT+zLD0Pehh/grugEG3XBpohtnSOvJi0H26/aOXp4AwYkWBeKxUpLtmudqol0+fFQI5ZrwSYQ4FBDmsnGUJAfpTvkeLMRzlbsoBW36M5ZJijUaX/unp5vbT+y3VZ+H205Uyn29ycS9pHmtxdlSc4u2V3CL7bgzMC2R3Qg/n13nFvP30auvP5UKkcfLCG4Zy6fwtP2uGuXARdftKzL/HaZ+cc2xz3dxBl1PnMdD72tEZOl7l+Cl9HRfFBZrTlN7kTlE9X/WiOfgQjkvCBpIMg//M00Y414ljTf30S13u5xPLSUqAcvpf6fo/g5/B+iMQUnBTNgo+g6cBXd2Avxwdct3gL066Lk4NfjmvFqUz+y9R3vxGYeBnUBxSGgFh+VsVKL03hDj9PggEAWY8/neKtS5OSLzPIy3E+2OTmePOYBl4edE4xtuR6LoHAJ3WNV255EKG7+pAQEAAP/30E7j99ObHhc/gL+D20/WA5fNVa/5ml0uHEeL9/184vzsz+9UYfjUVex20169uvkV9jMqLM9/x2olFyJ2T++4r8V7K/wniz0dzlR7v2PavEusluW0sDHOs5xi0gvCmQjcRlqhUMsyWKR8net9sNN9cS1nyJQQZj1O4wl+uoSw5r+Uo9jKUKwVL8AewSnGSh9p5z8+gkqRxDk4yytmPRV9Suuqr5bYBAlY0zvscZVLs5bh/GaSs6Bly6GwOVFkHAQWfxHK5JoqffwQoLp1asbybArdXxl/2yP/cFMOw+L4Mjv8jQDBOgFQCAMUUl0pfmttgCaaK8bqnB5CkGKI9iCAq5iyFjbslWwR0GX9r2yhcsvJuyV69LxUqFPupMHxnmJAbggEK0gKd7YuZTcBYDhhLuUwUpEB47dujuBZC+e1YYMAl49Atqljh8JzzeLK3n650+fz6hHJVEV7CjHAGRCDegJ8BxxgI8EporkMu8rVRhQI6zsPRkEcBzXbHVmF37NxTnEcK9mIKBH1zGXQc2fJYuvJ2gtPC3pgWrJ4fb3MusHjrqcevVt5xyvU8rcBNp4gNGNimAc8xcQkAHmee/4q7Uk7SeBPkauRI38tDIzekqAG/SrgM/mXqwW/BWe9l+7EbO118LbTOGP/ylseAFJOrPPMhoDHNm2CKYHoaihb+DhggxQg0CDHZ50wuLn0PmAcpxaiIziSNXYzKpe+BOe6OXw+JKM6JjiPaPIDSwDsORE5zT4r5Nk5DQPAGk7xzZnGUyy+uuj8DN+Ngi/P0/oEDH24wCDhIg5XPAY235dIlk4rYPgYfOn1+VRgFmARlFnsh5mVUKeVZ8fvZ4g1O0wDhshfTZX5NFtU5IwT89BOQx0rpb0ZB+vfSqHCuUbSTT6+fmg/3d6Wc+Etrdxx6CykmMUTHvgMnMP26tvyQOzKKOQbHXxIup1ycxVFPVr6SHEEWXqQcef4qnTv10jeayzP9casT28kLv8bzjuO+yiRB+K70fwEAAP//CDmYovkmAAA=" -> "H4sIAAAAAAAA/9RZ6XLiSLb+T0S/Q467ImYmagSSWGzc7YlBILFKgFZE3w4ipUyQUGqxMsVWXe9+Qyxuu8rVy42JuDP+A1KeLU9+55wvcTdNGE4YZx4z/AjigrAwgzmrxeEBox+AlxYJgvnx6U4dqrI0tbReR3fvKuUTZ+OchmnyCIQq/13luwrHvRb6rnKz3QtpltKQnWUhY9APYpywH8A6JDiBMX66C5OQVf315u5XLTOHCV3jnJMTP0VhsnkE917IXgmcQ2b4wGo+SQvE+WmyDjffVdQwxl8F9/1rmUqloDinjxUAOFBG8AiwL3LlywoAAFAarGDBgjQPTxitInw8y5Z/HLijNOByCkGn0+lIde0Eu8LRF+XysdeZd6ROp9PtzLuH7VoZDkl/3U3aoU8Gx9jJZSk3LZFMWiwy+qaAs3vUnZ32wtZtOUkwJ7OFmuFZHmoHbUH6D74zbdd0JZMQf2ore+34MVpvgva6OGpuoz38qMLW9Gja0qYZaKlyWOuLfjMcML9mzEniyUo4zoyoQcIsbcyXTGLxpvO8iYxOq3cKjhuvVTTVdngwh4eGI20LQ+X7i/lJ22Z4fQyd4iMd6h8D0crn0bgjFcXQnXv5lnxUAjuGk12+O5pTsaBTtktcaRt4s/1xei86sy3MxqjWDkz4PJOFvXJsWYqYLPzGbLPnN+Hca9HQU8zTvWbig1NvztsPz9l86qju2M82y5wYcDAYLw01YKfpvYqW+XSiWIvUEDq4c2xsAuZr+VQyidc0drP7+unEP0u6IvrdaWPK77Pmfv88C3Z7MWFePTMnM4YwG320m/x8lmTJ4mgYyTITT8rex6LgLQ6t+yRokySY5MvNFt/76TyZdZRDzSf1lmyMjpuwmPnS/mMkPLgFcdWF9QwlFu1Hk0jf9rKtuRBxUx0JrbR3T0cDv1FzmtFxPdkhldoBeha6i0HftqfZKd14fLtpuyGvL5QsWeo1Adubbk3/6NhH5q7dBz5f21MfdVKxv1wno+bJ1a3FaNRWlxFMDoe6fG9Nw0geaW1qbUWeP7W6xyM/XA+fTW8kSM31/RrVoa/nk0bPdy2kDGuCdNScliJs7/1l2OlPR2PNOy0U3qyz9cOBx8L86QnEcJvm/8oxCiCr+ml89xbvGInNptA+Y757wTxZ9oaCZsrN8t1wJglbhTSylmJK4WFgtvbTqLV4SLa15T1OZ9pcrqn8ftx4aI5B6hUIhm+cVfZ5yPCq7AjXsswgCx5BjcXZpbxXZY9Y7WBOz5H5ly7wCH65Bjo1JGs46a26U1Udmk8PdR+uH3geN8Wm2PAaQmN9v2566ybEPKr7bUH0H9pCW7xqd6fqbGrI+k39ft3E9RZC7caD0OTX0G94fL1Vb/ktVG973n0Li/hBQOsvnXdWXVk3nyYGzyaG0NUtNDJDqafbI8uwlqM5r1j6eY1n3UgYGZYu27LWmzvLxZJX6oY1kpY8sa2eNldF96TZUt+KmoInLnkcq02zF4l6P7A8UZcQr+uOlU08IRvBwXJrRoquW/vxnCgS4pfPum1r84gM5qZi65ZSR/whVPlmtlQQ9YWspy2WW8/R6kY/2JqR8DxfoJkt2y3T1pfYEmTb1Bawr03NRSahfVauNd6sRcrCtEc64u3EsXTHshVZlxUexerR2CqBXQ9ys883sZ215rwmWTyp64qyNCK2cyKSolibds8xj7qWpchLESmWrMhnWafdK5/nkaLNEyl3bMU1bE11T8HEcTLNskmCE0mfWpqkCqOJGqOh3pMO7kI5oe1m7NqjrR2pokbU5jIKDrplHaB1sB35oa72Rjre2icoZqlazw7mgAysbVC3iLubiNpIdYYHfyvZ2M5Mlz9AVfDrtp0d5/uU13p67NbTk7kgDU/RWrZgLy1BSuYRmcA+kqYDhfkkM1SnHbuOfsQD2zC77ORFS9lwWEOt+7l7UsZL2y7UWKOqgrIusXmnNxrowrKnE6SZorJbRnruKHZPT+yJMUBjy0F9c6CfDFmDjqPFiCDHUDKoRY0G4tFeJQp0zGHTPQWCt5CeVbsztuQldWS1sewr0JSFwFFIqJuSZix0R5W1oZFIdZ0nezchhWcTy+uyk57YotfTd3ZfOOJBusOLoOXLumhHwsyPlJE3zxqeSOs+sZk9sCO9byuWMOqaIpJUiwmuJRj2wA6MhaR7p1Hk1ZeH8alz0GP3NLcaR9vSJMTb0txRprYs9PUFGlo2kbtkaahyuzsnRNGjtL40l65aj/bLfpv6RnvskmXmRiRDol5YQifXIqE7lZGk2nZkLJDuWELXtZS+sUVEI5sTNqXIE/fjb+hKN119gZR52K5b1lKbW0J37riN9+vq8ILR+SaT9CQTNZEQg/ebnpJN/Gh4NB0BQlk5GDJRsXMIzDpxfNOv6yfSNe2RpSfa3kksXh0M67qg111eT1G8EXRL2xmKEnbjQ45MydWstrvkddEZaF2/3+4bg5GoymxmOAdTE+yxunD3Wp/uDEISZ+DnXj+z7IG6my6yvbcNDDs+MH9g7XRemJmmNbac0cDqsinc2tA/2bHOLxdQbtRNcyhYDrOnvdHYGwTEiBRqLYLhXDz0rL7dsCJNc02lqS06dbvfTKY9aWIQxGNbmk/nGW+JSJsnnbpm28bSeeA1y2pYcnY0ks4JDshOU0aNqT3SdZEdsaMZxgLF8ygQYT3QjHhZ+KJad4y2qDlE0LcBw7LQ6m413o3S5pjPmrqlCMYgPbgREnxLc8d1ZWzZuoW6bd07uUcUoYVrRU1LWE5cojZcO1Dnp9FUS5QtdEYHf2s1lltdNqL52Eg0ahoPdX+gNf2tstMWOu9Go0IjkTBfqO1ueOnJutWUh7KmWEQf6RHpzW1dufRyfvzlpDCMyWosu8aqo2tPME8e4Z4+UuznmNEYJnCD88eCchhSxgmP7Xr9vikK7ft2u32VesQHhvMEkpWfxllKcX5mmtymKfMb8+rOsCSjqw9n5nCqrdSO1ulfh1RH6/3fPdPCo34eZiUn564qnJ/GMUwQF81dkrZv/l3DlNXVYGqYWkeVVzNdVoaLJ8rgJkw23G0L3G0LX2apN9Sfapj5tZR6RUjQl4KG3NVl03jZmqz1ZtOhZq4sffIUMJbRx1rt7d6qL3urwhie0gTuackiaq95w3suv3pRZWlM3qcTP0XpNvz5+gAJSfcYrVAawzCh4An8BO4YhnH1arGa5pu7f4C7oPCqXo73X77fp3mE86+XwM2DD8ETuHs/ah9yfs6qGS550jW6i8E/Hd+/M443qd5hn6X59eO30krTIvcxrW7TosQNujlmxwyXrm/vb/wTH3xSILwqkpCdN3Z39UFxvgt9fPfzS05omES0mhbsS5twT1dnDrmHzA9WJN3Qm/kwyQp2TdiL65ds4ARlaZiw0sgNi6X2NxF4M7vJ0yJblTfLUvVaLKtbsdykKMsxjF/EXroAPVKSbl4ycL3/Vv0UYf+cI5omd5VKXiR+jC5smR4pw7HPCMAJ9AgGHJeke3DJ1W/czf/MLfvA0QATcmkc37pm/6XmhUnNgzSoUMwAh4sUZGGG1zAklcvhv0/qK9+DPmaABRiECWUw8TEY9qqVoWaYHa0rr4a9pw9/84ucAG5CQXkcj7Wa0GpXxWajev2sEcgwZbUYM8ghyGDtZosL0d9LHx1KcVwmKEgpKzNfrSjWZPLS4J7uPnx6v+d95j58ehXM57vS3Cwv4ZEWl8ATvH9lF/tBCu4MzFiYbK4n9LIMWAo+fHrj+nP1bNK4ZuELhWrl9q08ZYoZ92Lqwxsz/x2nfU3OZQ55ZYJeTp2lQB9ol2ToeBNShvO3uNiHLDjLVGoFzWsk9SE5RwL3FLwdFmCDGXd5xe0gKTD4n7JguFtpcyWgPnz6rTH0+apytRKiUv53xvJn8AvYPgMuB3dV46xnsDxMNnfgn5eEvJ7Aq2usq+sErpYFXrmp/5bk3R80Bn4B50PKY8Ct/2gAlfdYwvUHPMBxsGDpfxPWejgj6bFEWsmyAEwQ8HHOwnXol03jgreL0Blt1/kHup3XctWKByluNQCHAAd+/PFH8OHTF7f/z+Cf4MOn1wzo86vZ+YWXW9Mvg/r/g/O7pPZ3MfyGtr4F7eulu29JX1D5ksx3snZV4crklLn7yryfs3+D+dvRvCqPd/b2n4L1iiwZK8Oc6p2+/FRDeFdLdjEWEqFimB1TvlDuHcxrJPS+pt1fjKUi+xWClKU53OBfx1CR3d6BNHmRq1bCNfgL2OQ4K6F28/kZ1LI89WtxWiSM/lCiO6kA8D2QE1rkGMiSAUIK1gUhx5IYJthnGIF1mFNWrQCwTnNgDlVZB2ECPvHVap3nP/8AUHrmQeEaUAYZ+PBq8y8+yj8vxzA6f1+Hlx/xCcYZECoAoDTBlXMo3QD7UWlroRjnfz9ch2xIASQ5hugIYohwGc55j4c1XYXJOv2W2zha0+phTd+sV84hnP2pMHppJNyrPEOGAQrzMzs7lq7ikNKS41VKmyjMAfc2txdzHYTK6Xhm3GvKoHfuYueEl5qXk/3w6VUsn9+eUBkqwmtYEEYBD/g78AtgGAMOvjJaxlCafLupcwA6LuFoyJMwKQ4Xdn9gtPSd4xIp2E8TwOk7cMPfRa3E0qtsZzg/7zdNzqp+kO5LLbD6MlOPX715Jyk2zsN12UzhlTddERtSsM9DVrLhCgAsLfzgjXatmuXpLizDKMm5X0Kj3Mi5B/yu4Dr8j+kHf4RnvVftlwvUdfB10Lag7NdVlgJSMq+krHwIkjThSvKFYI5Alubsku+QAoIpBSSMMDmWSh6ufA+oD5MEozM6szz1MKpWvgfmtDf9WxzAI8LJ3x+BU/LlUsj3SxMlgPLQL7kGLX1e+DQrb6yA4B0mADJA07i0fx51/wBewcAel+X9VwYCuMMgZCAPNwEDSbqvVl4q6YztC/jQ9fOrxsjBLKzS1I8wq6JapayKP6+W7nCehwhX/TRZl2Py3J0LQsCPPwJ5qlR+Ms6iP1cm5+Qa5xvg09un9sN9q1IK/3qpQxDHacLlmKQQXe4dOIP5173lr2Ui45RhcLnqv5zy+SwucdLqK8sxpNGLlYvOv4Tb5bryjWvlTf7i6qp2zcLv6byTuK8qieO+q/xvAAAA//9eqS4amh4AAA==" # forces replacement
      ~ vpc_security_group_ids       = [
          - "sg-0be4cfbfac3cc0022",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdb" -> null
          - encrypted             = true -> null
          - iops                  = 150 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:933752197999:key/9630f91f-f3c0-42eb-b65d-3defffc79926" -> null
          - tags                  = {
              - "AppCode"      = "IMGB-001"
              - "Name"         = "🏗 External Composer (staging)"
              - "ServiceOwner" = "Image Builder"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0daeecfc25da04a05" -> null
          - volume_size           = 50 -> null
          - volume_type           = "gp2" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }


      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0704402452536a696" -> (known after apply)
          ~ volume_size           = 25 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # aws_instance.composer_internal must be replaced
-/+ resource "aws_instance" "composer_internal" {
      ~ arn                          = "arn:aws:ec2:us-east-1:933752197999:instance/i-027976fb9244722ee" -> (known after apply)
      ~ associate_public_ip_address  = false -> (known after apply)
      ~ availability_zone            = "us-east-1a" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-027976fb9244722ee" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      + key_name                     = (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-07088640399f60f49" -> (known after apply)
      ~ private_dns                  = "ip-10-30-18-11.ec2.internal" -> (known after apply)
      ~ private_ip                   = "10.30.18.11" -> (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [] -> (known after apply)
      - source_dest_check            = true -> null
      ~ subnet_id                    = "subnet-04a176042c3118735" -> (known after apply)
        tags                         = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🏗 Internal Composer (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ tenancy                      = "default" -> (known after apply)
      ~ user_data_base64             = "H4sIAAAAAAAA/9Ra63KjSJb+r4h+hxyXN3omapBASLLlbk+MLqCLBbK4SpqdUCRkSiAgwWSiW3W9yP7Zv/t4+wgboEvJLld198RE7Iz/qEjOPU+e/M6hOjFhmDDO2Cf4AURZyPwEpqwS+TuMfgJOnBEE0/3jjTJQpPbYVLstbXZTyp84C6fUj8kDEMr8D6UfShx3TfRD6Sy769Mkpj4raCFj0PUiTNhPYOmHmMAIP974xGdld7m6+cJlpJDQJU45ibgx8snqAdw5PrsiKExmeMcqbhhniHNjsvRXP5QUP8JfGffhmqZUyihO6UMJAA7kFjwA7Fa5fLEEAACUeguYMS9O/QNGiwDvC9r8jwM3lHpcSiFotVqttqgeYEfYu1Upf+y2Jq12q9XqtCad3XopDwZhb9khTd8N+/vITqV2apjVcNRggd4zBJzcoc7zYSusZw2beJPweaok+Dn11Z06DXv3rj1uVjQ5aSP+0JS36v5jsFx5zWW2V2e15uCjAhvjvWG1V3VPjeXdUpv26n6fuRV9EhJHkv2nRA9qoZ/EtcmctVm0ar2sAr3V6B68/cppZHWl6e+Mwa5mt9eZrvC96eSgrhO83Pt29pEOtI9e1UwnwVOrnWWD2cRJ1+FH2bMiONqkm70xrmZ0zDZk1l57zvN2P76r2s9rmDyhStMz4MuzJGzlfcOUq2Tq1p5XW37lT5wG9R3ZONypBt7ZYn3SvH9JJmNbmT25yWqehjrs95/muuKxw/hOQfN0PJLNaawLLdza11Yec9V03DZCp65vnu/Ew4F/aWty1e2Ma2N+m9S325dnb7OtEuaIiTF6Zgiz4Uerzk+eSUKme10n86R6kLcurgrOdNe4I14zJN4ona/W+M6NJ+S5Je8qbig2JH24X/nZs9vefgyE+1kWzpSp+QLbLNgOR4G27iZrY1rFdWUoNOLuHR323VrFrgf75WiDFGp56EXoTPs9yxonh3jl8M26NfN5bSonZK5VBGytOhXto23t2Ww5u+fTpTV2USuu9uZLMqwfZpo5HQ6byjyAZLcTpTtz7AfSUG1Sc13l+UOjs9/zg+XgxXCGQru+vFsiEbpaOqp13ZmJ5EFFaO9VuyEL6zt37rd64+GT6hymMm+IbHm/47EweXwEEVzH6V9TjDzIym4c3bzOd4yq9brQLHK+c8z5cN4dCKoh1fO1wXNbWMthLWnIRtvf9Y3Gdhw0pvdkXZnf4fhZnUgVhd8+1e7rTyB2MgT9V8pK29RneJFXhNOxTCDzHkCFRcnxeC/yGrHYwJQWlrnHKvAAfjkZOtbb5mDUXXTGijIwHu9FFy7veR7Xq/VqzakJteXdsu4s6xDzSHSbQtW9bwrN6om7M1aex7qkndnvlnUsNhBq1u6FOr+Ebs3hxYbYcBtIbDrOXQNX8b2Alm+VtxYdSTMeRzrPRrrQ0Uw0NPx2V7OGpm7OhxNeNrXiHc86gTDUTU2yJLU7sefTOS+Lujlsz/nQMrvqRKnODqrV7plBXXCqcx5HSt3oBlWt55lOVWsjXtNsMxk5QjKE/fnaCGRNM7dPk1BuI37+olmWOgnC/sSQLc2URcTvfIWvJ3MZUVdIuup0vnZsVdR73toIhJfJFD1bktUwLG2OTUGyDHUKe+rYmCZttE3yd7VX7wJ5alhDDfEWsU3NNi1Z0iSZR5Gy19eyZ4leavT4OraSxoRX2yYfiposz/WAbewgjFGkjjuFzcOOacrSvIpkU5KlgtZudvPnSSCrE9JObUue6ZaqzA7eyLYT1bRCgklbG5tqWxGGIyVCA63b3s2m8gGtV08za7i2AqWqhkp9Hng7zTR30NxZtnQvKt2hhtfWAVaTWBGTndEP++baE81wthlV1aFiD3buum1hKzFm/A4qgitaVrKfbGNe7WrRTIwPxjSsObLasARrbgptMgnCEeyh9rgvMzdMdMVuRjNb2+O+pRsddnCCuaTbrKaIbjo7yE9zy8qUSKWKjJJOaPF2d9jXhHlXC5FqVOXNPNBSW7a6GrFGeh89mTbqGX3toEsqtG01QiGydTmBalCrIR5tlVCGtjGozw6e4EzbL4rVejKlObUlpTbvydCQBM+WQ18z2qo+1WxFUgc6aYsaH25nJMwcKzSdDjtoxKo6XW1j9YQ97scbPPUarqRVrUB4dgN56EySmlOlohtazOpbgdazZFMYdowqaismE2amoFt9y9Onbc05DANHnO+eDq2dFs0OE7O2t0y1jXirPbHlsSUJPW2KBqYVSp1writSszMJQ1kLYnFuzGeKGGznvSZ19ebTLJwnsyBMUFXLTKGVqoHQGUuorVhWoE+RZptCZ2bKPX2NQjVcHbDRDpzq9ukbvO0zrzZF8sRviqY5Vyem0JnYs9r752p3ydHJKmlrJKmq1TDUebfuyMnIDQZ7wxYglOSdLoUKtneeIYa2a7iidgg7hjU0NaJubWLySn8gaoImzngtRtFK0Ex1o8uy34l2KTLaM9Vszua8VrX7asftNXt6f1hVJPas2ztDFawnZTrbqj260cOQ2H03dXqJafWVzXiabJ21p1vRjrl9c6PxwrNhmE+mPeybHTaGawu6ByvS+PkUSjXRMAaCaTNr3B0+OX0v1AOZmlNvMKnuumbPqpmBqs4Mua5OW6LVq5Nxtz3SQ8Rjqz0ZTxLerCJ1Qlqialn63L7nVdOsmVKy10nrAPvhRpWHtbE11LQq22Nb1fUpiiaBV4Wip+rRPHOrimjrzapqh4K29hiWhEZnrfKzIK4/8UldM2VB78e7WYAE11RnT6L8ZFqaiTpNzTnM9ihA05kZ1E1hPpqFSm1mecrkMByrRF5De7hz12ZtvtYkPZg86USlhn4vun217q7ljTrV+FkwzNQwECZTpdnxjzVZM+vSQFJlM9SGWhB2J5YmH2s5//T2ptD10eJJmumLlqY+wpQ8wC19oNhNMaMRJHCF04eMchhSxgkPTVG8q1eF5l2z2TxRPfiE4ZTAcOHGURJTnBZIk6PxJq0FJ3W62dY72uDZGIzVhdJSW73TJdVSu/+4Zpo51E39JMfk3ImFc+MoggRxwWQWxs2z/pluSMqiP9YNtaVIi2dNkgfTR8rgyicr7uwCd3bhbZS6A+2xgplbiamT+SF6S6hLHU0y9Itrktp9Hg9UY2Fqo0ePsYQ+VCqbxMUcjwRRqNdEvlGvNR3BRVzzsEvvDvVN+bXv5Yvv5ZyxDCN4iAnc0hxqVK7BxXt2fbVQZnEUvo85/hbEa//vpwcYhvEWowWKI+gTCh7B38ANwzAqnySW43R182dw42VO2Unx9u36Nk4DnH79Cpw1uBA8gpv3rXYh56asnOAcTJ2sOwr83fb90+x4E+koJj5L3fdD+QEo+WtwbNCyFOapCZZxCgYRXGHQztXgFPgEtGy9fOHqxi59AOdEiQodxT4X/6qg2M3yZrMQd1wreywKSxcBHQ+7AcAbnO6ByAOK3ZggCiBBIIxXgMWA7mkYr84qKWYAQRzFBIj81VpOfKT8IruVhxxA18WUgo0P88YSsIwQHBaCMQbMwyA6e07jEF/ryd1CIIlTBqr3QjU36vQ2/8soBhChNBcexi4MvZiyq/fwqB1FPnkoVHwxzMKpv9wD5kEGtvjHFAMSM4Ah88kq5zuahaM43YOYFE8+oQwS92Jfpy91nk7lAdzm9eGi2l+eeTOa791fwF39P64My3e1Dty9G2J6tcw8TADeYRdUMppWCpcqjk8qSXyIUydmCxji9MoLidAsPYYwjWNWzBPonjIcAZ+SHxlYZmH42l55MJJONhcszy2jDyrXltMEuvhi+D3/teHMj17ZvfWZ5xMg/JNdenu0fqd7lzslwSn1aX7aTt5uYFoJfedbFflfIArHM3k6If4SbDFwIQEphq4HXETKX1rHL5VAHRvSHyMP7hEmf3oANgZbPwwBDLdwT8EKMwBBjReBh1MMHOzC/PzES+CGfh4bF6eMvo5mntQg9XC4cBEB9sDog1a3q0m6/saI68gtoR/i62Oa+GT1DwTjuyLzilCriddLacxiNw6PpfDqBWWQZXm1r/Him+0ClIYgLkAABZ9Ap5X3rgN50GkZUp5Jp7qdejSquLBy9JfLcJKXd/D5H3LqciP8qvNfXxF/KEgdSL3LpuuYIFDw0DxfzmLKr2+VHynAZOOnMcnvArCBqQ+dEFMAUwzOVwRGRWo8XFh/96XyQVKtgTZWFUk1zsk8MSVTegVmXjKcvQUl1xit4ucXHuccLzzu7BJ3glwnuYqk662e9Hjzv//9X/8DbpWxOjAWkiWpRnE+Twu6pFmDjpTX8NNKkdOQnR+7LUM6j3o0STdHxuPtH+GWAvpCAcUEcRGmRRXguMJwLktDcHvxCnBnAs6J0R7c3J4Mu/nTSSp2vRjcHmWX3kKCDXZZnJ5+vge0aJylLqbldZzlcBOdoQjbJzgHI+f1sy9454YZwouM+KyAOjcnHRSnG9/FN3+/oCTqk4CW44y9lQm3dFGMnraQud4ijFf0LN4nScZOEOqi+oKPMEFJ7BOWC3kNYQXMi4ID67woQod36xx+2azi3aZazqV/H7ieda/SOEsWBEaFkaesWJyB+JmKshTD6EJ2uQ2OEOUSptNsvezGCLtFIGlMbkqlNCNuhI6TONeLYgQ+7n7D2T6S8nc8/xbyceB4dbksBJjkpw9wHIm3J/Bz3J3vfET4PZ8Ddhz1cBgeO5xvfQ+4KiY51OJwFoPET3BebEvHdHt/+lj6AHqYvcJEYNAtlwaqbrTUjrQYdB9v/+jm54Qb0aKKPFQqQqNZrtZr5dNvJYQMU1aJMIMcggxWzrI4H/0p19GiFEd5mHJUl29juSSbo9GlE3u8uf30fnP2mbv9dGXM55tc3HOaJ2ScHQ0neHsltziiNzpmBfw7QYzz67ys3n56pfpzuRCpn6LwhqFcOv8r32uKGXcRdftKzL/Hbp+Cc2yYnTxAl11nMdD66jEYGl7lICt9nRfFLZvTlN6cnaLEvupac4TCHZe4DQwzDP4zPzbcuZgcC++n7/XLn08sJyk+yul/ZX7wGfwC1i+AS8FNWS/4dJb6ZHUD/nIMyPWoYHGydXEaFZTzalE6s3+P8uY3CgO/gGKT0ghwy99qQOm9ccbpSyPgOJix+N8p17o4CeN9nmkB3h870Ryc+kvfzYvGMd+ORNeNAui0runKJQdS3KgBDgEO/Pzzz+D205vPFJ/BX8Dtp+tRzeer/v2NlksbEuD9/186vzt9+9UcfjVfe520169uvkV9zMpLMN+J2omFy4OTx+4r8W7K/gniz1tzdTze8e1fJddLUltf6MZYy4FqBeFNhWwiLBChpBstQzrOBr/Zjb65lrLkSwpSFqdwhb9cQ1lyXsuh7mVyV/KX4A9gleIkT7Wzzs+gkqRxDk4ywuhPRfNSumq+pbYOfFp01/scihLs5s3B0k9p0Vjk+NoYKJIGfAI+8eWyyPOffwIoLp36tbzlArdXzl905H9OiuFxurv0j//bIMQ4AUIJABQTXCp96YD9JZjK+uvGH8AwxRDtQQRRMYwpfNwt6cIny/hbaqNgScu7JX31vlSYUOhTYPDOxCF3BAPkpwU62xeDHZ/SHDCWcpnITwH3OrZHcS2E8tuxwIBLyqBTVLEi4DnncWdvP13Z8vn1DuWmIryEWcgo4AF/A34BDGPAwSuhuQ25yNdOFQZoOE9HXRr5JNsd+4ndsb1PcZ4p2I0J4LTNZRpyZMtz6SraCU4Lf2NSsLpevM25wOJtpB6+WnknKNdDtwI3nTLWp2Cb+izHxCUAWJy53ivuSjlJ442fm5EjfTdPjdyRogb8KuHS/5epB78FZ7132o8t2+nia6F1RtmXtywGYTHeyk8+BCQmeadMEExPk9Mi3j4FYTEn9QMc7nMmB5c+AOpCQjAqsjNJYwejcukDMMbd8etJEsE50XGOmydQ6rvHqclpOEow28ZpAEK8wWHeXtM4yuUXV92fgZMxsMX58f6RAQ9uMPAZSP2VxwCJt+XS5SQVuX1MPnT6/aowcjDxyzR2A8zKqFLKT8XvZ4s3OE19hMtuTJb5NVlU5ywMwc8/A2ksl/6mF6R/L42K4OpFO/n4+ql5f9co5cRfWrvjZJxLcRhDdOw7cALTr2vLj3kgo5hhcPzccNnlYi+OdtLyleQI0uAi5cjzV+Hczpe+0Vye6Y+qTmynKPwazzuB++okcdwPpf8LAAD//5mzG1JDJwAA" -> "H4sIAAAAAAAA/9RZaXPqyLn+TtX8h47nVCWpE4EWwMYzTgWBxCphtCJyU1RL3SCh1nLULbYz57/fEovHPsez3UrVTfwFS/1u/fTT7wK9LGU4ZZx1zPEjSErCohwWrJFEB4x+AH5WpggWx6c7baQp8szW+13Du6tVT5yDCxpl6SMQ6vx3te9qHPda6LvazXY/onlGI3aWhYzBIExwyn4A64jgFCb46S5KI1YP1pu7n7WsAqZ0jQtOSYMMRenmEdz7EXslcA6Z4QNrBCQrERdk6TrafFfTogR/E9z3r2VqtZLigj7WAOBAFcEjwIHIVS9rAABAabiCJQuzIjphtIrx8Sxb/XHgjtKQKygE3W63K0v6CfaEYyAq1WO/O+/K3W631533Dtu1OhqRwbqXdqKADI+JWyhyYdkimbZZbA4sAef3qPd82gtbr+2m4Zw8L7QcPxeRftAXZPAQuLNOw1BzGfGnjrrXjx/j9SbsrMuj7jU7o48abM+OliNvWqGeqYe1sRi0oiELGuacpL6iRpPcjJskyrPmfMlklmy6nzax2W33T+Fx47fLltaJDtbo0HTlbWlq/GAxP+nbHK+PkVt+pCPjYyjaxTyedOWyHHlzv9iSj2roJHC6K3ZHayaWdMZ2qSdvQ/95f5zdi+7zFuYT1OiEFvz0rAh79di2VTFdBM3nzZ7fRHO/TSNftU73uoUPrtSadx4+5fOZq3mTIN8sC2LC4XCyNLWQnWb3GloWs6lqLzJT6OLusbkJWaAXM9kifsvcPd9LpxP/STZUMejNmjN+n7f2+0/P4W4vpsyXcmv6zBBm449Oi58/p3m6OJpmuszFk7oPsCj4i0P7Pg07JA2nxXKzxfdBNk+fu+qhERCprZjj4yYqnwN5/zEWHrySeNrC/gRlFu/H09jY9vOttRBxSxsL7ax/T8fDoNlwW/FxPd0hjToh+iT0FsOB48zyU7bx+U7L8SLeWKh5ujQaAnY2vYbx0XWOzFt7D3yxdmYB6mbiYLlOx62TZ9iL8bijLWOYHg6Scm/PolgZ6x1qb0WeP7V7xyM/Wo8+Wf5YkFvr+zWSYGAU02Y/8GykjhqCfNTdtips74Nl1B3MxhPdPy1U3pLY+uHAY2H+9AQSuM2KfxQYhZDVgyy5e8t3jMRWS+icOd+7cJ4s+yNBt5RW9W70LAtblTTztmrJ0WFotfezuL14SLeN5T3OnvW50tD4/aT50JqAzC8RjN44q+2LiOFVlRGu1zKHLHwEDZbkl+u9qnLEagcLeo4suGSBR/DTNdCZKdujaX/Vm2nayHp6kAK4fuB53BJbYtNvCs31/brlr1sQ80gKOoIYPHSEjnjV7s2055mpGDf1+3ULS22EOs0HocWvYdD0eakttYM2kjq+f9/GIn4Q0Ppr591VTzGsp6nJs6kp9Awbja1I7hvO2Dbt5XjOq7ZxXuNZLxbGpm0ojqL35+5yseRVybTH8pInjt3X55ronXRHHthxS/DFJY8TrWX1Y9EYhLYvGjLiDcO186kv5GM4XG6tWDUMez+ZE1VG/PKT4Tj6PCbDuaU6hq1KiD9EGt/KlyqigZD39cVy67u6ZA7CrRULn+YL9OwoTttyjCW2BcWx9AUc6DNrkcton1drzTdrsbqwnLGBeCd1bcO1HVUxFJVHiXY0t2roSGFhDfgWdvL2nNdlmyeSoapLM2Y7NyYZSvRZ7xzzuGfbqrIUkWorqnKWdTv96nkeq/o8lQvXUT3T0TXvFE5dN9dth6Q4lY2ZrcuaMJ5qCRoZffngLdQT2m4mnjPeOrEm6kRrLePwYNj2AdoHx1UeJK0/NvDWOUExzzQpP1hDMrS3oWQTbzcV9bHmjg7BVnawk1sef4CaEEiOkx/n+4zX+0biSdnJWpCmr+ptR3CWtiCn85hM4QDJs6HKApKbmttJPNc44qFjWj128uOlYrqsqUlB4Z3UydJxSi3RqaaivEcc3u2Ph4aw7BsE6Zao7paxUbiq0zdSZ2oO0cR20cAaGidT0aHr6gkiyDXVHOpxs4l4tNeICl1r1PJOoeAv5E+a053YypK6itZcDlRoKULoqiQyLFk3F4arKfrITGXJ4MneS0npO8T2e+xkpI7o942dMxCOeJjt8CJsB4ohOrHwHMTq2J/nTV+kUkAc5gyd2Bg4qi2Me5aIZM1mgmcLpjN0QnMhG/5pHPvS8jA5dQ9G4p3mdvPo2LqMeEeeu+rMUYSBsUAj2yFKjyxNTen05oSoRpxJS2vpaVK8Xw46NDA7E48scy8mORKN0ha6hR4LvZmCZM1xYnOBDNcWep6tDswtIjrZnLAlx764n/yCrnzTNRZInUcdybaX+twWenPXa75/rw4vHJ1vctlIc1EXCTH5oOWr+TSIR0fLFSBU1IOpEA27h9CSiBtYgWScSM9yxraR6ns3tXltOJIMwZA83shQshEMW9+Zqhr1kkOBLNnT7Y635A3RHeq9YNAZmMOxqCns2XQPli44E23h7fUB3ZmEpO4wKPxBbjtDbTdb5Ht/G5pOcmDB0N4ZvPBsWfbEdsdDu8dmcOvA4OQkBr9cQKUpWdZIsF3mzPrjiT8MiRmr1F6Eo7l46NsDp2nHuu5ZaktfdCVn0EpnfXlqEsRjR57P5jlvi0ifp11Jdxxz6T7wum03bSU/mmn3BIdkp6vj5swZG4bIjtjVTXOBknkcilAKdTNZloGoSa7ZEXWXCMY2ZFgR2r2tzntx1prwecuwVcEcZgcvRkJg695EUie2Y9io1zH8k3dEMVp4dtyyheXUI1rTc0JtfhrP9FTdQnd8CLZ2c7k1FDOeT8xUp5b5IAVDvRVs1Z2+MHgvHpc6iYX5Quv0oktONuyWMlJ01SbG2IhJf+4Y6iWX85OvK4VpTlcTxTNXXUN/gkX6CPf0keKgwIwmMIUbXDyWlMOQMk547EjSfUsUOvedTucq9RilDBcpJKsgS/KM4uLcaXI02xXN+OrOtGWzZ4yerdFMX2ldvTu4Fqmu3v+/e6alT4MiyquenLuqcEGWJDBFXDz3SNa5+fdMS9FWw5lp6V1NWT0bijpaPFEGN1G64W5b4G5b+Bql/sh4amAWNDLqlxFBXwuaSs9QLPNla4ref56NdGtlG9OnkLGcPjYauzzAHI8ESWg1Jb7danZ8IUBc53Qo7k+tXf3t3usve69XinWYwFOWwj2tWo3G6+bivbi+eVFnWULe7zn+GWfb6F/XB0hItsdohbIERikFT+Cf4I5hmNSvFutZsbn7G7gLS7/uF3j/9ft9VsS4+HYJ3DwEEDyBu/ejDiAXFKye46qZukZ3MfiH4/t3xvEG6h0OWFZcP34NVpqVRYBpfZuVFbnQzTE75rhyfXt/a1LxISAlwqsyjdh5Y3dXHxQXuyjAd/96wYRGaUzrWcm+tgn3dHVuNPeQBeGKZBt6Mx+lecmugL24fkEDpyjPopRVRt4SVsC8JPiwxUsS9PmgxeFPu0122In1yvqv0/Tme1NkZb6qZtTK/vXarW7X7iZFWYFh8iL2kk/okZJs8wLTdZKuBxnCwRlImqV3tVpRpkGCLn03PVKGk4ARgFPoEww4Ls324ALor0z5f2ReP3A0xIRcUtAvDex/avhR2vAhDWsUM8DhMgN5lOM1jEjtwpD3x4Pa92CAGWAhBlFKGUwDDEb9em2km1ZX7ymrUf/pw1+CsiCAm1JQndljoyG0O3Wx1axfPxsEMkxZI8EMcggy2LjZ4iL018pHl1KcVACFGWUV8vWaak+nL6ny6e7D5/ez5xfuw+dXwXy5q8w9FxWHsvISeIr3r+ziIMzAnYkZi9LN9YRelgHLwIfPb1x/qZ9NmlcUvlKo127/VadMMeNeTH14Y+a/47Sv4Fwqml8B9HLqLAPGUL+AYeBNRBku3vJiH7HwLFNrlLRokCyA5BwJ3FPwtqyADWbc5RW3g6TE4H+qC8Pd7j9XEerD518raF+uKlcrEarkf6PAfwE/ge0nwBXgrm6e9UxWROnmDvz9AsjrWr66xrq61vJ6dcFrN/Vfk7z7ncbAT+B8SEUCuPXvDaD2Xr9x/SoQcBwsWfbfxLU+zkl2rJhW9WsApggEuGDROgqqpHHh20XozLZrkQS97mu5es2HFLebgEOAAz/++CP48Pmr7xG+gL+DD59f91JfXhXYr7zckn4V1P8fnd9tj3+Tw28a4Lekfb1090vSF1a+gPkOalcVrgKnwu4b80HB/g3mb0fz6nq8s7f/FK7XFNlcmdbM6A6UpwbCu0a6S7CQCjXT6lrKpXnfwaJBIv/bBv6rslTmP1OQsqyAG/xzGSrz2zuQpS9y9Vq0Bn8CmwLnFdVuPr+ARl5kQSPJypTRHyp2pzUAvgdKSssCA0U2QUTBuiTkWHWPKQ4YRmAdFZTVawCsswJYI00xQJSCz3y9LvH8lx8Ays59ULQGlEEGPrza/IuP6s8vMLyMX+vo8nMAwTgHQg0AlKW4dg6lF+IgrmwtVPP8Q8a1yEYUQFJgiI4ggQhX4Zz3eFjTVZSus19ym8RrWj+s6Zv12jmEsz8Nxi+JhHuFM2QYoKg4d2fHylUSUVr1eLXKJooKwL3F9mKui1BVHc9t+Zoy6J+z2BnwSvNysh8+v4rly9sTqkJFeA1LwijgAX8HfgIMY8DBV0arGCqTbzd1DsDAFR1NZRql5eEyAhwYrXwXuGIKDrIUcMYO3Ph3Uau49ArtHBfn/WbpWTUIs32lBVZfI/X4zZt3QHFwEa2rZAqvfdOVsREF+yJiVTdcA4BlZRC+0W7U8yLbRVUYVXMeVNSoNnLOAb8puI7+Y/LB7+mz3rvtlynrWvi6aFtS9vMqywCpOq+0uvkQpFnKVc0XggUCeVawC94RBQRTCkgUY3KslHxc+x7QAKYpRmd25kXmY1SvfQ+sWX/2lySER4TTvz4Ct+qXK6EgqExUBCqioOo1aOXz0k+zaqwFBO8wAZABmiWV/XOp+xvwSwb2uLref2YghDsMIgaKaBMykGb7eu3lJp25fSEfun5+kxg5mEd1mgUxZnXUqFW34o+rZTtcFBHC9SBL11WZPGfnkhDw449Amam1f5pn0X/VpmdwzfME+PT2qfNw365Vwj8PdQjiJEu5ApMMosvcgXNYfJtb/lwBmWQMg8v3AS+nfD6LS5y0/spyAmn8YuWi8w/hNoHXfmGsvMlfXF3Vrij8ls47wH1zkzjuu9r/BgAA//98XG2M5B4AAA==" # forces replacement
      ~ vpc_security_group_ids       = [
          - "sg-084607083aaa39727",
          - "sg-0eb65fd8f2c17dba5",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdb" -> null
          - encrypted             = true -> null
          - iops                  = 150 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:933752197999:key/9630f91f-f3c0-42eb-b65d-3defffc79926" -> null
          - tags                  = {
              - "AppCode"      = "IMGB-001"
              - "Name"         = "🏗 Internal Composer (staging)"
              - "ServiceOwner" = "Image Builder"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-058d1cec56397f102" -> null
          - volume_size           = 50 -> null
          - volume_type           = "gp2" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }


      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-012b26d028ee8c5d7" -> (known after apply)
          ~ volume_size           = 25 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # aws_launch_template.worker_external_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_external_x86" {
      ~ default_version         = 11 -> (known after apply)
        id                      = "lt-0195b4ef20679c780"
      ~ latest_version          = 11 -> (known after apply)
        name                    = "imagebuilder_worker_external_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 External Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "H4sIAAAAAAAA/9RZ2ZLqyJm+J6LfIYeuibbjjEALUEXZ1WEEEqsEaAU8DiKVSpBQaikpxXZ8XmRu5nYebx5hQiCqqTqn227bERNdN1XK/Lf88l+zunFEcUQZ45TgZxDmhPoJTGk99I/Y/QNw4jxyYXp6qSpDRRKnptrraMtqpfhiLJxmfhw9A67Gflf5rsIw90TfVW6ye36WxJlPL7SQUoi8EEf0D2DjExzBEL9U/cinNbTZVn/iMlIYZRucMlKEYtePts/g0fHpHcHFZIqPtI5InLsMiqONv/2uovgh/sq47+9pKpU8w2n2XAGAAYUFzwAjnikWKwAAkGXeGubUi1P/jN11gE8X2uKHAdUs85g0g6DT6XREQT3DLndCvFR89jrzjtjpdLqdefe428jDIelvulHbR2RwCu1UElPD5MmkRQO9b3A4eXS7s/OB2y1bduTNyWyhJHiW+upRXZD+E7Kn7bomJ6LLntvyQT19CjZbr73JT+qy0R5+UmBrejIscdv01Fg+brRFv+kPKKrrcxI5kuyPEz1oED+JG/MVFWm47bxuA73T6p2909Zp5U2l7R+N4bFhi7tcV9j+Yn5WdwnenHw7/5QNtU8eb6bzYNwR83y4nDvpjnySPSuEk326PxlTPs+mdB8txZ3nzA6n6SNvz3YwGbv1tmfA15nEHeRTy5T5aIEas+2B3fpzp5X5jmycH1UDH22hOW8/vSbzqa0sxyjZrlKiw8FgvNIVj56nj4q7SqcT2VzEOtfBnVNj61GkplPRIE5T388ehfOZfRU1mUfdaWPKHpLm4fA68/YHPqKOkBiTGXUxHX2ymux8FiXR4qTr0Srhz/IBYZ5zFsfWY+S1SeRN0tV2hx9RPI9mHflYR0RoSfrotPXzGRIPnwLuaZmTpbIwX6FIg8NoEmi7XrIzFjxuKiOuFfces9EANep2MzhtJntXySzPfeW6i0HfsqbJOd46bLtpLX1WW8hJtNLqHLa23br2ybZOdLlZPrHpxpoitxPz/dUmGjXPS81cjEZtZRXA6HgUpEdz6gfSSG1n5o5n2XOrezqxw83w1XBGnNjcPG5cASItnTR6aGm68rDOiSfVbsnc7hGt/E5/Ohqrznkhs4ZAN09HFnPzlxcQwl2c/inFrgdpDcVh9b2/Y5dvNrn2xee7V58nq96QUw2pWawNZyK3k0kjacmG6B8HRuswDVqLp2hXXz3ieKbOpbrCHsaNp+YYxE7uQv+dssoh9SleFxmhDMsEUu8Z1GmYXMN7XeSI9R6m2cUydM0Cz+CvpaFTXTSHk966O1WUofHyJCC4eWJZ3OSbfMNpcI3N46bpbJoQs66A2hyPntpcmy+5u1NlNtUl7cb+uGlioeW67cYT12Q3EDUcVmgJLdRyhbbjPLYwj584d/NReWfdlTTjZaKzdKJzXc10R4Yv9jRrZOrmajRnZVO77LG0G3Aj3dQkS1J7c3u1WLGyoJsjccUSy+ypc4VfnlVL7JtBk3P4FYtDpWn0Al7re6bDa6LLapptJhOHS0ZwsNoZgaxp5mE8J7LosqtXzbLUeUAGc0O2NFMWXPboK2wzWcluhrikpy5WO8dWBb3v7YyAe50v3JklWS3D0lbY5CTLUBewr06NRSK6h6TYa7zbC+SFYY00l7Ui29Rs05IlTZJZN1RO+k72LMFLjT7bxFbSmrOqaLJE0GR5pQd0bwckdkN12r3YPOqapiyteFc2JVm60NrtXvE9D2R1HompbclL3VKV5dmb2HaimhaJcCRqU1MVFW40UUJ3qPXE43Ihn93ddry0RjsrUHiVKM1V4B010zxC82jZ0pOg9EYa3llnyCexIiRHY0AG5s4TTLLcT3h1pNjDI9qJFrYSY8keocIhwbKS0/wQs2pPC5dCfDYWpOHIasvirJXJidE8IBPYd8XpQKaIJLpit8OlrZ3wwNKNLj07wUrSbdpQBJQuz/J4ZVm5EqqZIrtJl1is3RsNNG7V04irGry8XwVaastWT4usiT5wx6bt9o2BdtYlFdq2GrrEtXU5gWrQaLise1CIDG1j2FyePc5ZiK+K1Rmb0iqzJaWx6svQkDjPlomvGaKqLzRbkdShHomCxpLDMiK5YxHT6dKzFlm809P2Vp874UG8xwuvhSSNtwJuhgJ55MyThsNnAiIWtQZWoPUt2eRGXYN3RcWk3NLkdGtgefpC1JzzKHCE1XF87hy1cHmem42TZaqiy1ri3JanlsT1tYU7NC0idclKV6R2d06IrAWxsDJWS0UIDqt+O0N6e7wkq2QZkMTltdzkOqkacN2p5IqKZQX6wtVsk+suTbmv71yiku0ZG2Lg8Ifxz/CKN15t4cpzvy2Y5kqdm1x3bi8b346r45uPzreJqEUJr/KE6CxqOnIyQcHwZNgchJJ81CWiYPvoGQKxkYEE7Uy6hjUytUg92JHJKoOhoHGasGS12A23nGaqe12W/W54TF1DXKpme7liNd4eqF3Ub/f1wYhXJDrT7aOhctZYWSwPaj/b64RE9gClTj8xrYGyny6Sg7PzdCs8UjQw9xrLzQzDHJv2aGB26RTuLIjOVqixqwWUGoJhDDnTpta0Nxo7A4/ogZyZC2845489s281zEBVl4bcVBcdweo3o2lPnOjEZbElzqfzhDV5V51HHUG1LH1lP7GqaTZMKTnpUecMB2SvyqPG1BppGk9P2FZ1feGG88DjoeCperjKEa8Itt7mVZtw2s6jWOJa3Z3KLoO4OWaTpmbKnD6Ij8vA5ZCpLseCPDYtzXS7bc05L09u4C6WZtA0udVkSZTG0vKU+Xk0VSN5B+3REe3MxmqnSXowH+uRmhn6k4AGahPt5L260NhlMMpVEnDzhdLu+tecrJlNaSipskm0kRaQ3tzS5GsuZ8cfK8Vgqhsv+EhxGkFSyyjc+tG2qGZJnOG0FmdO7hO3Fqfbj5ydXk+TdP2Fe+RrAldrNWocV9LYU20saWtdn6zH0lJfdzT1BabRMzxkzxlGKaZZCCO4xelznjEYZpThntuC8NjkufZju90uqZ4znO59hC+9KzPk+4Idlyp0U9S72nBmDKfqWumonX5Z9jpq75/QlzsZSv2k6PKZkoVBcRjCyGWC+ZLE7Zv+pW5IygU+taNI65kmycPFSwkgc0OUOcRpUPbjd9j1htpLHVNUL/FlboDfpEtdTTL0t4NJam82HarG2tQmLx6lSfZcr78/We3tZDUYwnMcwUNW3GP9vg/5lsqvFmo0Dsm325M/B/HO/0v5AQmJD9hdu3EI/SgDL+DPoEoxDO+9pvofoOrlTs1J8eHj+hWbr7fATQOC4AVUv201ggxKaS3BRd9VWncV+Kvt+5fZ8QHpMI58mqJvQ/k9UIptcJ3l8hQWPgc2cQqGIdxiIBZqcAr8CHRsvfbG1YtR9gxuPhBedFzu+fJX3Y1RXsylF3HXtZpHQ1J5E9D1MAoA3uP0BAQWZBjFkZsBGLmAxFtAY5CdMhJvbyozTIELcRhHQGDv1griK+VPsjsF5AAihLMM7H1YzKCA5lGEyUUwxoB6GIS3k2cxwfd6imO5IIlTCvgnji+MKneLnzzDALpuWggnMYLEizN6tw+v2t3Qj54vKn4yzMKpvzkB6kEKDviHFIMopgBD6kfbgu9qFg7j9ATi6PLlRxmFEXqzrzuQuuMy7sFDEfhvqv3NjTfPirv7ETw2//3OsOJWmwCdEMHZ3TL1cATwESNQz7O0fjlS3fGjehKf49SJ6RoSnN6dQoqyPL1CmMYxvTw9ZKeM4hD4WfQDBZuckPf2ysOJVNp8YZl1jAGo31ueJRDhN8Of2K8Np374zu6DTz0/Aty/4khXbyx9w9+AAwYIRiDFEHkAuVHtp/nqpxhQp4b0u9CDJxdHv38GNgYHnxAAyQGeMrDFFEDQYAXg4RQDByNYeE68AYj4OKIA4ZRm72EqrhOkHiZr5EbAHhoDUNa3D0bcI7eBPsH3Dpr40fYfAOMXRRax0GgI90tpTGMUk2sSuNvIKKR5kecarPDhukCWERBf6loGPoNupxjwhvKw2zGkwkXKjJV6WVhHsH49L5PjpEhs4Ms/dKi3XPg3D/91cvy3C6kDM+/t0nUcueDCkxX+chNTe59Pf8gAjvZ+GkdFFgR7mPrQITgDMMXglhyxe3GN5zfWX51Ov5dUa6hNVUVSjZszz03JlN5V6Ncc5/hDOb5vO+p+keoZ55rqmduRmLKLKOUqkq53+tJL9X//+7/+BzwoU3VorIuB27jEZ7mgS5o17EpF9ipXLj4N6e2z1zGk23uIJunmxHh5+B08ZCB7zUCGI5cJcXbJAgxzMZzJUwIe3k4FmBsB48TuCVQfSsOqvy+lYuTF4OEqu/KxGO4xonFa/vqlFiOL8xThrLaL86KDcm9FmJ4SXJTh2/rtLPiISO7idR759FLkq6WOsnms/uWtP8j8KMhqcU4/yoSHbH15nzlAirw1ibfZTbwfJTktm4c31W+dAY7cJPYjWgi53XrB/bPd2E3sNo3zZB3B8KK/vPD1rW28UWU0xTB8I7s2Kutr1X07f/myXEOxi9EFoSyOqpVKmkcodK/vUMgLYxd8Ov4dQXslZR9Z9mMXw4BrsUGUABwVYQUYJooPZT2/wv4LT+i/5jH8yGQeJuTajf/ca/hdlii6BwbnMUj8BBdZtHL1o2+/vVW+B31M35V5MOzVKkNVNzpqV1oPey8Pv0NFADCT7JIenut1rtWu8c1GrfxdJ5DijNZDTCHjQgrrN1mM7/6+0NHJMhwWMBWNSnGJtYpsTiZvU8NL9eHztweJL8zD5ztjvlQLcbO08LQ4vxoe4cOd3EvsVXVMLx1N2RTctot8+fD5neovtYtIvUThA0OtcvuruOsMU+ZN1MM7Mb+N2y7BuQ53TgHQ263TGGgD9QqGhrd+RnH63i8u5bOgqXyInUvufDeDFa0Hc11i9pDkGPxnETbMLUtcM+rnX5ruvpQspRTfLej/xqz7BfwV7F4Bk4JqTb/w6TT1o20V/HgF5H6sXZe2rsuxtlZki8qN/Zcoq3+nMPBXcLmkNATM5u81oPKt0bv8PxtgGJjT+Lfkaz2ckPgEAnzKLkX6mrmzq5+Vm4WX3cZI0O1c2lJ/4yNIca3iwAy3GoBxAQP++Mc/gofPH17nv4AfwcPn+xeFL3ez6M+pCfDpMum90/X/5dffeCb6m65clsAC2Pee+9NG9duUV7d8A/Vr9K4MTIBPFwQ/CEYp/ScF367mLi6+Os1vz8UvPUJRHb7h6EV1yZM7ksr3wJj2pu9ntwhjt8jDKI72OC3qkX/p8HuqDooSm4JDMXMcMCAwj5BXqyBIL0FRvUO6HNe+3KNfVKkvVfDjj/cm/IYgvpXzPClxBWVPW+I7S3FSzDUfH6V+yECKw5jij2yX2M9iFOBiAP6Zbu4m7SqifMH800dYn58eWfYrMBnmu8r/BQAA//9Y6a1NjiEAAA==" -> (known after apply)
        # (8 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_launch_template.worker_internal_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_internal_x86" {
      ~ default_version         = 9 -> (known after apply)
        id                      = "lt-0a23e96f3feb1649c"
      ~ latest_version          = 9 -> (known after apply)
        name                    = "imagebuilder_worker_internal_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 Internal Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "H4sIAAAAAAAA/9R52XLqSJ73PRH1DvlR/qK644xAC2Djblc0AolVArQCPR1EKpUgodRiKcV2+rzI3MztPN48woQEuLDPqdPLdMRE+cZW5n/LX/7XdDeOKI4oY5wS/AzCnFA/gSmth/4Ru38ATpxHLkxPL1VlqEji1FR7HW1ZrRRfjIXTzI+jZ8DV2B8qP1QY5p7oh8pNds/PkjjzaUkLKYXIC3FE/wA2PsERDPFL1Y98WkObbfUXLiOFUbbBKSNFKHb9aPsMHh2f3hGUJlN8pHVE4txlUBxt/O0PFcUP8VfG/XhPU6nkGU6z5woADCgseAYY8UyxWAEAgCzz1jCnXpz6Z+yuA3wqaYsfBlSzzGPSDIJOp9MRBfUMu9wJ8VLx2evMO2Kn0+l25t3jbiMPh6S/6UZtH5HBKbRTSUwNkyeTFg30vsHh5NHtzs4Hbrds2ZE3J7OFkuBZ6qtHdUH6T8ietuuanIgue27LB/X0KdhsvfYmP6nLRnv4SYGt6cmwxG3TU2P5uNEW/aY/oKiuz0nkSLI/TvSgQfwkbsxXVKThtvO6DfROq3f2TlunlTeVtn80hseGLe5yXWH7i/lZ3SV4c/Lt/FM21D55vJnOg3FHzPPhcu6kO/JJ9qwQTvbp/mRM+Tyb0n20FHeeMzucpo+8PdvBZOzW254BX2cSd5BPLVPmowVqzLYHduvPnVbmO7JxflQNfLSF5rz99JrMp7ayHKNku0qJDgeD8UpXPHqePiruKp1OZHMR61wHd06NrUeRmk5FgzhNfT97FM5n9lXUZB51p40pe0iah8PrzNsf+Ig6QmJMZtTFdPTJarLzWZREi5OuR6uEP8sHhHnOWRxbj5HXJpE3SVfbHX5E8TyadeRjHRGhJemj09bPZ0g8fAq4p2VOlsrCfIUiDQ6jSaDtesnOWPC4qYy4Vtx7zEYD1KjbzeC0mexdJbM895XrLgZ9y5om53jrsO2mtfRZbSEn0Uqrc9jaduvaJ9s60eVm+cSmG2uK3E7M91ebaNQ8LzVzMRq1lVUAo+NRkB7NqR9II7WdmTueZc+t7unEDjfDV8MZcWJz87hxBYi0dNLooaXpysM6J55UuyVzu0e08jv96WisOueFzBoC3TwdWczNX15ACHdx+qcUux6kNRSH1ff+jl2+2eTapc93Lz5PVr0hpxpSs1gbzkRuJ5NG0pIN0T8OjNZhGrQWT9GuvnrE8UydS3WFPYwbT80xiJ3chf47ZZVD6lO8LjLCNSwTSL1nUKdhcgnvdZEj1nuYZqVl6JIFnsFfr4ZOddEcTnrr7lRRhsbLk4Dg5ollcZNv8g2nwTU2j5ums2lCzLoCanM8empzbf7K3Z0qs6kuaTf2x00TCy3XbTeeuCa7gajhsEJLaKGWK7Qd57GFefzEuZuPyjvrrqQZLxOdpROd62qmOzJ8sadZI1M3V6M5K5taucfSbsCNdFOTLEntze3VYsXKgm6OxBVLLLOnzhV+eVYtsW8GTc7hVywOlabRC3it75kOr4kuq2m2mUwcLhnBwWpnBLKmmYfxnMiiy65eNctS5wEZzA3Z0kxZcNmjr7DNZCW7GeKSnrpY7RxbFfS+tzMC7nW+cGeWZLUMS1thk5MsQ13Avjo1FonoHpJir/FuL5AXhjXSXNaKbFOzTUuWNElm3VA56TvZswQvNfpsE1tJa86qoskSQZPllR7QvR2Q2A3Vabe0edQ1TVla8a5sSrJU0trtXvE9D2R1HompbclL3VKV5dmb2HaimhaJcCRqU1MVFW40UUJ3qPXE43Ihn93ddry0RjsrUHiVKM1V4B010zxC82jZ0pOg9EYa3llnyCexIiRHY0AG5s4TTLLcT3h1pNjDI9qJFrYSY8keocIhwbKS0/wQs2pPC5dCfDYWpOHIasvirJXJidE8IBPYd8XpQKaIJLpit8OlrZ3wwNKNLj07wUrSbdpQBJQuz/J4ZVm5EqqZIrtJl1is3RsNNG7V04irGry8XwVaastWT4usiT5wx6bt9o2BdtYlFdq2GrrEtXU5gWrQaLise1CIDG1j2FyePc5ZiK+K1Rmb0iqzJaWx6svQkDjPlomvGaKqLzRbkdShHomCxpLDMiK5YxHT6dKzFlm809P2Vp874UG8xwuvhSSNtwJuhgJ55MyThsNnAiIWtQZWoPUt2eRGXYN3RcWk3NLkdGtgefpC1JzzKHCE1XF87hy1cHmem42TZaqiy1ri3JanlsT1tYU7NC0idclKV6R2d06IrAWxsDJWS0UIDqt+O0N6e7wkq2QZkMTltdzkOqkacN2p5IqKZQX6wtVsk+suTbmv71yiku0ZG2Lg8Ifxr/CKN15t4cpzvy2Y5kqdm1x3bi8b346r45uPzreJqEUJr/KE6CxqOnIyQcHwZNgchJJ81CWiYPvoGQKxkYEE7Uy6hjUytUg92JHJKoOhoHGasGS12A23nGaqe12W/W54TF1DXKpme7liNd4eqF3Ub/f1wYhXJDrT7aOhctZYWSwPaj/b64RE9gClTj8xrYGyny6Sg7PzdCs8UjQw9xrLzQzDHJv2aGB26RTuLIjOVqixqwWUGoJhDDnTpta0Nxo7A4/ogZyZC2845489s281zEBVl4bcVBcdweo3o2lPnOjEZbElzqfzhDV5V51HHUG1LH1lP7GqaTZMKTnpUecMB2SvyqPG1BppGk9P2FZ1feGG88DjoeCperjKEa8Itt7mVZtw2s6jWOJa3Z3KLoO4OWaTpmbKnD6Ij8vA5ZCpLseCPDYtzXS7bc05L09u4C6WZtA0udVkSZTG0vKU+Xk0VSN5B+3REe3MxmqnSXowH+uRmhn6k4AGahPt5L260NhlMMpVEnDzhdLu+pecrJlNaSipskm0kRaQ3tzS5EsuZ8cfK8VgqhsvfkRxGkFSyyjc+tG2qGZJnOG0FmdO7hO3Fqfbj5ydXk+TdP2FY2sCW+Oeahx3JbGn2ljS1ro+WY+lpb7uaOoLTKNneMieM4xSTLMQRnCL0+c8YzDMKMM9twXhsclz7cd2u32lenZSfCj7VuZRNjEmV/m6KepdbTgzhlN1rXTUTv9a8jpq759XluVOhlI/KTp85srCoDgMYeQywXxJ4vZN/1I3JKWETu0o0nqmSfJw8XIFj7mhyRziNLj24ne49YbaSx1TVL9iy9zAvkmXuppk6G8Hk9TebDpUjbWpTV48SpPsuV7fJwgzrMsJXLMhsK1mo+1wyGXa52P6eG7ua+9PXns7ea1grMEQnuMIHrLiouv3jcq37PpqoUbjkHy7f/lzEO/8v1w/ICHxAbtrNw6hH2XgBfwZVCmG4b1bVf8NVL3cqRV3/XH9AuDXW+CmAUHwAqrfthpBBqW0luCiMbtadxH4D9v3L7PjA9JhHPk0Rd+G8kegFNvgMuzlKSwcE2ziFAxDuMVALNTgFPgR6Nh67Y2rF6PsGdwcJSx1lPdc/lV3Y5QXg2sp7rJW82hIKm8Cuh5GAcB7nJ6AwIIMozhyMwAjF5B4C2gMslNG4u1NZYYpcCEO4wgI7N1aQXyh/EV2p4AcQIRwloG9D4shFdA8ijApBWMMqIdBeDt5FhN8r6c4lguSOKWAf+L4wqjrbvGTZxhA100L4SRGkHhxRu/24UW7G/rRc6niF8MsnPqbE6AepOCAf0oxiGIKMKR+tC34LmbhME5PII7KLz/KKIzQm33dgdQdX5MDeCiyw5tqf3PjzbPi7n4Gj83/f2dYcatNgE6I4OxumXo4AviIEajnWVovj1R3/KiexOc4dWK6hgSnd6eQoixPLxCmcUzLt4nslFEcAj+LfqJgkxPy3l55OJGuNpcss44xAPV7y7MEIvxm+BP7teHUD9/ZffCp50eA+1cc6eKNV9/wN+CAAYIRSDFEHkBuVPtlAPslBtSpIf0u9ODJxdHvn4GNwcEnBEBygKcMbDEFEDRYAXg4xcDBCBaeE28AIj6OKEA4pdl7mIrrBKmHyRq5EbCHxgBcC+AHI+6R20Cf4HsHTfxo+0+A8V2RRSw0GsL9UhrTGMXkkgTuNjIKaV7kuQYrfLgukGUExGXxy8Bn0O0UE+BQHnY7hlS4yDVjpV4W1hGsX87L5DgpEhv48k8d6i0X/s3Df50c/19J6sDMe7t0HUcuKHmywl9uYmrv8+lPGcDR3k/jqMiCYA9THzoEZwCmGNySI3ZL13h+Y/2H0+mPkmoNtamqSKpxc+a5KZnSuzL+muP8Yzm+703qfpHqGeeS6pnbkZhrq3GVq0i63ulLL9X//s//+C/woEzVobEuJnKjjM/rgi5p1rArFdnrulL6NKS3z17HkG4PJpqkmxPj5eF38JCB7DUDGY5cJsRZmQUYpjScyVMCHt5OBZgbAePE7glUH66GVX9/lYqRF4OHi+zKx2K4x4jG6fXX91qMLM5ThLPaLs6LNsu9FWF6SnBRhm/rt7PgIyK5i9d55NOyyFevOjKc7n2Eq3956w8yPwqyWpzTjzLhIVuXDzgHSJG3JvE2u4n3oySn1+bhTfVbZ4AjN4n9iBZC3jdvHGYFzoFNVhCgw6Img1/32/i452uF9O+3bDfd2zTOk3UEw9LIq1esbw3ojSqjKYbhG9mlm1lfSvMbSNf36RqKXYxKGLM4qlYqaR6h0L28ZiEvjF3w6fh3RPaFlH1k2Y+tDgMuFQlRAnBUxB5gmCg+XIv+5W6+8xD/jzypH5nMw4Rc+vpfe1O/SyVFi8HgPAaJn+Ai1VYuzvbtF7zKj6CP6bteAAx7tcpQ1Y2O2pXWw97Lw+9QESXMJCtzyHO9zrXaNb7ZqF1/1wmkOKP1EFPIuJDC+k0W47u/L3R0sgyHBUxFN1NcYq0im5PJ2/zxUn34/O2R5Avz8PnOmC/VQtwsLdwxzi+GR/hwJ7cM0KqOadn2XDuH23aRVB8+v1P9pVaK1K8ofGCoVW5/FXedYcq8iXp4J+a3cdtXcC5jolMA9HbrNAbaQL2AoeGtn1GcvveLssYWNJUPsVMm2HfTWtGfMJclZg9JjsG/F2HD3FLJJe1+/t6c+OXKcpXiuwX935iav4C/gt0rYFJQrekln05TP9pWwc8XQO4H5PXV1vV1QK4V2aJyY/8eZfXvFAb+CspLSkPAbP5eAyrfGuKv/60DDANzGv+WfK2HExKfQIBPWVnJL5k7u/jZdbPwstusCbqdsnf1Nz6CFNcqDsxwqwEYFzDgj3/8I3j4/OGN/wv4GTx8vn+b+HI3sP6amgCfynHwna7/K7/+xmvT33TlawksgH3vub9sVL9NeXHLN1C/Ru/CwAT4VCL4QTBK6f9S8O1q7uLiq9P89ly87BGK6vANRy+qS57ckVR+BMa0N30/4EUYu0UeRnG0x2lRj/xyDOipOihKbAoOxWBywIDAPEJerYIgLYOieof0dab7co9+UaW+VMHPP9+b8BuC+FbO8+SKK7g2vld8ZylOiuHn48vVTxlIcRhT/JGtjP0sRgEupuRf6eZu0i4irm+hf/oI6/PTI8t+BSbD/FD5nwAAAP//gR822tQhAAA=" -> (known after apply)
        # (8 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_spot_fleet_request.workers_external_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_external_x86" {
      ~ client_token                        = "terraform-20210208150235951500000002" -> (known after apply)
      ~ id                                  = "sfr-953d7aa5-e8cc-4a45-afee-cee5a9453de6" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "External worker fleet - staging"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-0195b4ef20679c780" -> null
              - version = "11" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-0195b4ef20679c780"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_spot_fleet_request.workers_internal_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_internal_x86" {
      ~ client_token                        = "terraform-20210208150245361200000004" -> (known after apply)
      ~ id                                  = "sfr-42015bc6-166c-4fcf-b0e8-5f9fe66fddb5" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "Image Builder internal worker fleet - staging"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-0a23e96f3feb1649c" -> null
              - version = "9" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-0a23e96f3feb1649c"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_volume_attachment.composer_external must be replaced
-/+ resource "aws_volume_attachment" "composer_external" {
      ~ id          = "vai-1070839764" -> (known after apply)
      ~ instance_id = "i-0418ebc127d387b16" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_volume_attachment.composer_internal must be replaced
-/+ resource "aws_volume_attachment" "composer_internal" {
      ~ id          = "vai-777369723" -> (known after apply)
      ~ instance_id = "i-027976fb9244722ee" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 6 to add, 2 to change, 6 to destroy.
```

</details>

*Pusher: @major, Action: `pull_request`*